package com.example.romadanapp;

import androidx.appcompat.app.AppCompatActivity;

import android.app.Activity;
import android.app.AlertDialog;
import android.content.Context;
import android.content.DialogInterface;
import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.view.View;
import android.widget.TextView;
import android.widget.Toast;

public class a1 extends AppCompatActivity{


    TextView t1;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a1);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("মাহে রমযান বছরের বাকি এগার মাস অপেক্ষা অধিক মর্যাদাশীল ও বরকতপূর্ণ মাস। এ মাসের বিশেষত্ব অনেক।\n" +
                "\n" +
                "১. এ মাসেই মানুষ ও জিন জাতির মুক্তির সনদ কুরআন মজীদ একত্রে লাওহে মাহফূয থেকে প্রথম আসমানে বাইতুল ইযযতে অবতীর্ণ হয়  এবং রাসূলে কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট সর্বপ্রথম এ মাসেই ওহী অবতীর্ণ হয়। কুরআন মজীদে ইরশাদ হয়েছে- (তরজমা) ‘রমযান মাসই হল সে মাস যাতে নাযিল  করা হয়েছে কুরআন, যা মানুষের জন্য হেদায়াত এবং সত্যপথযাত্রীদের জন্য সুস্পষ্ট পথনির্দেশ। -সূরা বাকারা ১৮৫\n" +
                "\n" +
                "২. এ মাসে রহমতের দরজা উন্মুক্ত করে দেওয়া  হয়। হাদীস শরীফে এসেছে- ‘রমযান মাস শুরু হলেই রহমতের দরজা খুলে  দেওয়া হয়।’ -সহীহ মুসলিম, হাদীস ১০৭৯/২\n" +
                "\n" +
                "৩. অন্য এক হাদীসে এ মাসের ফযীলত বর্ণিত হয়েছে যে, ‘রমযান মাসের শুভাগমন উপলক্ষে জান্নাতের দরজাসমুহ উন্মুক্ত করে দেওয়া হয়  এবং জাহান্নামের দরজাগুলো বন্ধ করে দেওয়া হয়। আর শয়তানকে শৃংখলাবদ্ধ করা  হয়।’ -সহীহ বুখারী, হাদীস ১৮৯৯; সহীহ মুসলিম, হাদীস ১০৭৯/১\n" +
                "\n" +
                "৪. এ মাস জাহান্নাম থেকে নাজাত লাভের মাস। সুতরাং বেশি বেশি ইবাদত ও ইস্তেগফারের মাধ্যমে মুক্তির পরওয়ানা লাভ করার এটিই সুবর্ণ সুযোগ। হাদীস শরীফে এসেছে- ‘আল্লাহ তাআলা প্রত্যহ ইফতারের সময় অসংখ্য ব্যক্তিকে জাহান্নাম থেকে মুক্তি দিয়ে থাকেন।’ -মুসনাদে আহমদ হাদীস ২১৬৯৮\n" +
                "\n" +
                "৫. ব্যবসায়ী মহলের একটি বিশেষ মৌসুম থাকে যখন তাদের ব্যবসা হয় খুব জমজমাট ও লাভজনক। সে মৌসুমে বৎসরের অন্য সময়ের চেয়ে অনেক বেশি আয় হয়। আখেরাতের ব্যবসায়ীদের জন্য আখেরাতের সওদা করার উত্তম মৌসুম হল এই রমযান মাস। কেননা এ মাসে প্রতিটি আমলের অনেক গুণ বেশি ছওয়াব পাওয়া যায়। নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন- ‘রমযানের ওমরা হজ্জ সমতুল্য।’ -জামে তিরমিযী, হাদীস ৯৩৯; সুনানে আবু দাউদ, হাদীস ১৯৮৬\n" +
                "\n" +
                "অন্য এক বর্ণনায় (যা সনদের দিক থেকে দুর্বল) বিষয়টি এভাবে বর্ণিত হয়েছে যে, ‘রমযান মাসে যে ব্যক্তি একটি নফল আদায় করল সে যেন অন্য মাসে একটি ফযর আদায় করল। আর যে এ মাসে একটি ফরয আদায় করল সে যেন অন্য মাসে সত্তরটি ফরয আদায় করল। -শুআবুল ঈমান ৩/৩০৫-৩০৬\n" +
                "\n" +
                "অর্থাৎ এ মাসে নফল আদায় করলে অন্য মাসের ফরযের ন্যায় ছওয়াব হয়। আর এ মাসের এক ফরযে অন্য মাসের ৭০ ফরযের সমান ছওয়াব পাওয়া যায়।\n" +
                "\n" +
                "এ তো হল রোযা ছাড়া এ মাসের অন্যান্য আমলের ছওয়াব। আর রোযার ছওয়াব সম্পর্কে আল্লাহ তাআলা নিজেই ইরশাদ করেন- (তরজমা) ‘নিশ্চয় রোযা আমার জন্য, আর এর প্রতিদান স্বয়ং আমিই দিব।’ সহীহ মুসলিম, হাদীস ১১৫১/১৬৫\n" +
                "\n" +
                "রমযান মাস রহমত, বরকত, মাগফিরাত, জাহান্নাম থেকে মুক্তি ও জান্নাত লাভের মাস। তাই এমন মাস পেয়েও যে ব্যক্তি স্বীয় গুনাহ মাফ করাতে পারল না তার জন্য স্বয়ং জিবরাঈল আ. বদদুআ করেছেন এবং নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রাহমাতুল্লিল আলামিন হয়েও আমীন বলে সমর্থন জানিয়েছেন।  হাদীস শরীফে এসেছে- ‘নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মিম্বরে উঠে আমীন, আমীন, আমীন বললেন। তাঁকে বলা হল, হে রাসূল! আপনি তো এরূপ করতেন না। নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন, জিবরাঈল আমাকে বললেন, ঐ ব্যক্তি ধ্বংস হোক যে পিতা-মাতা উভয়কে অথবা একজনকে পেয়েও (তাদের খেদমত করে) জান্নাতে প্রবেশ করতে পারল না। তখন আমি বললাম, আমীন। অতঃপর তিনি বললেন, ওই ব্যক্তি ধ্বংস হোক যে রমযান পেয়েও নিজের গুনাহ মাফ করাতে পারল না। আমি বললাম, আমীন। জিবরাঈল আবার বললেন, ওই ব্যক্তি ধ্বংস হোক যার নিকট আমার নাম আলোচিত হল অথচ সে আমার উপর দুরূদ পড়ল না। আমি বললাম, আমীন। -আল আদাবুল মুফরাদ : ২২৫, হাদীস ৬৪৬; সহীহ ইবনে হিববান, হাদীস ৯০৮\n" +
                "\n" +
                "আল্লাহ তাআলা আমাদের সকলকে রমযানের হক আদায় করার তওফীক দান করুন এবং নবীজীর অভিসম্পাৎ থেকে রক্ষা করুন। আমীন!");
    }
}