package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a11 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a11);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("মাসআলা : রোযার নিয়ত করা ফরয। নিয়ত অর্থ সংকল্প। যেমন মনে মনে এ সংকল্প করবে, আমি আল্লাহর সন্তুষ্টির উদ্দেশ্যে আগামী কালের রোযা রাখছি। মুখে বলা জরুরি নয়।\n" +
                "\n" +
                "হাদীস শরীফে আছে, সকল আমল নিয়তের উপর নির্ভরশীল। সহীহ বুখারী ১/২; বাদায়েউস সানায়ে ২/২২৬\n" +
                "\n" +
                "মাসআলা : ফরয রোযার নিয়ত রাতেই করা উত্তম।\n" +
                "\n" +
                "উম্মুল মুমিনীন হাফসা রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন- من لم يجمع الصيام قبل الفجر فلا صيام له  যে  ব্যক্তি ফজরের আগে রোযা রাখার নিয়ত করবে না তার রোযা (পূর্ণাঙ্গ) হবে না।-সুনানে আবু দাউদ ১/৩৩৩; আলবাহরুর রায়েক ২/২৫৯-২৬০; বাদায়েউস সানায়ে ২/২২৯\n" +
                "\n" +
                "মাসআলা : রাতে নিয়ত করতে না পারলে দিনে সূর্য ঢলার প্রায় এক ঘণ্টা আগে নিয়ত করলেও রোযা হয়ে যাবে।\n" +
                "\n" +
                "সালামা ইবনুল আকওয়া রা. বলেন, (আশুরার রোযা যখন ফরয ছিল তখন) রাূসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আসলাম গোত্রের একজন ব্যক্তিকে ঘোষণা করতে বললেন, ‘যে সকাল থেকে কিছু খায়নি সে বাকি দিন রোযা রাখবে। আর যে খেয়েছে সেও বাকি দিন রোযা রাখবে। কারণ আজ আশুরা-দিবস।’-সহীহ বুখারী ২০০৭\n" +
                "\n" +
                "আবদুল করীম জাযারী রাহ. বলেন, কিছু লোক সকালে চাঁদ দেখার সাক্ষ্য দিল। তখন উমর ইবনে আবদুল আযীয রাহ. বললেন, ‘যে ব্যক্তি (ইতিমধ্যে কিছু) খেয়েছে সে বাকি দিন খাওয়া থেকে বিরত থাকবে। আর যে খায়নি সে বাকি দিন রোযা রাখবে।’-মুহাল্লা ৪/২৯৩; বাদায়েউস সানায়ে ২/২২৯; ফাতাওয়া হিন্দিয়া ১/১৯৬\n" +
                "\n" +
                "মাসআলা : পুরো রমযানের জন্য একত্রে নিয়ত করা যথেষ্ট নয়; বরং প্রত্যেক রোযার নিয়ত পৃথক পৃথকভাবে করতে হবে। কারণ প্রতিটি রোযা ভিন্ন ভিন্ন আমল (ইবাদত)। আর প্রতিটি আমলের জন্যই নিয়ত করা জরুরি।\n" +
                "\n" +
                "হাদীস শরীফে আছে, সকল আমল নিয়তের উপর নির্ভরশীল।-সহীহ বুখারী ১/২; আরো দেখুন : আলমুহাল্লা ৪/২৮৫; মাবসূত, সারাখসী ৩/৬০; ফাতাওয়া হিন্দিয়া ১/১৯৫\n" +
                "\n" +
                "মাসআলা : রাতে রোযার নিয়ত করলেও সুবহে সাদিক পর্যন্ত পানাহার ও স্ত্রী-মিলনের অবকাশ থাকে। এতে নিয়তের কোনো ক্ষতি হবে না।\n" +
                "\n" +
                "আল্লাহ তাআলা ইরশাদ করেছেন-  أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ  রমযানের রাতে তোমাদের জন্য স্ত্রী সম্ভোগ হালাল করা হয়েছে।-বাকারা ২ : ১৮৭\n" +
                "\n" +
                "মাসআলা : নিয়তের সময় শুরু হয় পূর্বের দিনের সূর্যাস্তের পর থেকে। যেমন-মঙ্গলবারের রোযার নিয়ত সোমবার দিবাগত রাত তথা সূর্যাস্তের পর থেকে করা যায়। সোমবার সূর্যাস্তের পূর্বে মঙ্গলবারের রোযার নিয়ত করা যথেষ্ট নয়। কেননা, হাদীস শরীফে রাতে নিয়ত করার কথা বলা হয়েছে।-আলমুহীতুল বুরহানী ৩/৩৪৩; রদ্দুল মুহতার ২/৩৭৭");
    }
}
