package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a12 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a12);



        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("মাসআলা : সাহরী খাওয়া সুন্নত। পেট ভরে খাওয়া জরুরি নয়, এক ঢোক পানি পান করলেও সাহরীর সুন্নত আদায় হবে।\n" +
                "\n" +
                "হাদীস শরীফে আছে, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন-\n" +
                "\n" +
                "تسحروا، فإن في السحور بركة.\n" +
                "\n" +
                "‘তোমরা সাহরী খাও। কেননা, সাহরীতে বরকত রয়েছে।’-সহীহ মুসলিম ১/৩৫০\n" +
                "\n" +
                "অন্য হাদীসে বলা হয়েছে, সাহরী খাওয়া বরকতপূর্ণ কাজ। সুতরাং তোমরা তা পরিত্যাগ করো না। এক ঢোক পানি দিয়ে হলেও সাহরী কর। কারণ যারা সাহরী খায় আল্লাহ তাআলা তাদের উপর রহমত বর্ষণ করেন এবং ফেরেশতারা তাদের জন্য রহমতের দুআ করেন।’-মুসনাদে আহমদ ৩/১২; মুসান্নাফে ইবনে আবী শায়বা, হাদীস : ৯০১০; সহীহ ইবনে হিববান, হাদীস ৩৪৭৬\n" +
                "\n" +
                "মাসআলা : সুবহে সাদিকের কাছাকাছি সময় সাহরী খাওয়া মুস্তাহাব। তবে এত দেরি করা মাকরূহ যে, সুবহে সাদিক হয়ে যাওয়ার আশঙ্কা হয়।\n" +
                "\n" +
                "আবদুল্লাহ ইবনে আববাস রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন-\n" +
                "\n" +
                "إنما معاشر الأنبياء أمرنا أن تعجل فطرنا وأن تؤخر سحورنا، قال الهيثمي رجاله رجال الصحيح.\n" +
                "\n" +
                "‘সকল নবীকে সময় হওয়ার পরপরই ইফতার তাড়াতাড়ি করতে এবং সাহরী শেষ সময়ে খেতে আদেশ করা হয়েছে।’-আলমুজামুল আওসাত ২/৫২৬; মাজমাউয যাওয়াইদ ৩/৩৬৮\n" +
                "\n" +
                "আমর ইবনে মায়মুন আলআওদী বলেন, ‘সাহাবায়ে কেরাম দ্রুত ইফতার করতেন আর বিলম্বে সাহরী খেতেন।’-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৫৯১; মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৯০২৫\n" +
                "\n" +
                "মাসআলা : দেরি না করে সূর্যাস্তের সাথে সাথে ইফতার করা মুস্তাহাব।\n" +
                "\n" +
                "হাদীস শরীফে আছে,\n" +
                "\n" +
                "لا يزال الناس بخير ما عجلوا الفطر.\n" +
                "\n" +
                "‘যতদিন মানুষ দেরি না করে সূর্যাস্তের সঙ্গে সঙ্গে ইফতার করবে ততদিন তারা কল্যাণের উপর থাকবে।’-সহীহ বুখারী ১/২৬৩\n" +
                "\n" +
                "মাসআলা : মাগরিবের নামায পড়ার আগেই ইফতার করে নিবে, যেন সূর্যাস্তের সাথে সাথে ইফতার করার সওয়াব পাওয়া যায়।\n" +
                "\n" +
                "আনাস ইবনে মালিক রা. বলেন, ‘রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাগরিবের নামায পড়ার আগে তাজা খেজুর দিয়ে ইফতার করতেন। তাজা খেজুর না পেলে শুকনা খেজুর দ্বারা। আর তাও না পেলে এক ঢোক পানি দ্বারা ইফতার করতেন।’\n" +
                "\n" +
                "-সুনানে তিরমিযী, হাদীস : ৬৯২\n" +
                "\n" +
                "মাসআলা : খেজুর দ্বারা ইফতার করা মুস্তাহাব। খেজুর না পেলে পানি দ্বারা ইফতার করবে।\n" +
                "\n" +
                "من وجد تمرا فليفطر عليه ومن لا يفطر على ماء، فإن الماء طهور.\n" +
                "\n" +
                "আনাস ইবনে মালিক রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন, ‘যার কাছে খেজুর আছে সে খেজুর দ্বারা ইফতার করবে। খেজুর না পেলে পানি দ্বারা ইফতার করবে। কেননা পানি হল পবিত্র।’-সুনানে তিরমিযী, হাদীস : ৬৯৪");
    }
}
