package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a13 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a13);


        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("ইফতারের সময় দুআ কবুল হয় তাই এ সময় বেশি বেশি দুআ-ইস্তিগফার করতে থাকবে। বিশেষত এই দুআ করবে-\n" +
                "\n" +
                "اَللهُمَّ إِنِّيْ أَسْأَلُكَ بِرَحْمَتِكَ الَّتِيْ وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِيْ. رواه ابن ماجه، وقال البوصيري في الزوائد : هذا هديث صحيح، ورجاله ثقات. \n" +
                "\n" +
                " হে আল্লাহ! আমি তোমার কাছে তোমার সেই রহমতের উসীলায় প্রার্থনা করছি যা সকল বস্ত্ততে পরিবেষ্টিত, তুমি আমাকে মাফ করে দাও।-সুনানে ইবনে মাজাহ পৃ. ১২৫, হাদীস : ১৭৫৩\n" +
                "\n" +
                "আর ইফতার গ্রহণের সময় এ দুআ পড়বে-\n" +
                "\n" +
                "اَللهُمَّ لَكَ صُمْتُ وَعَلىٰ رِزْقِكَ أَفْطَرْتُ.  \n" +
                "\n" +
                "হে আল্লাহ! আমি তোমার জন্যই রোযা রেখেছিলাম এবং তোমার রিযিক দ্বারাই ইফতার করলাম।-সুনানে আবু দাউদ হাদীস : ২৩৫৮\n" +
                "\n" +
                "ইফতারের পর নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এই দুআ পড়তেন-\n" +
                "\n" +
                "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ الْعُرُوْقُ وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللهُ. رواه أبو داود، وصححه الحاكم في المستدرك، ولم يتعقبه الذهبي. \n" +
                "\n" +
                "পিপাসা দূর হল, শিরা-উপশিরা সতেজ হল আর আল্লাহ তাআলা চান তো রোযার সওয়াব লিপিবদ্ধ হল।-সুনানে আবু দাউদ ১/৩২১, হাদীস : ২৩৫৭; মুসতাদরাকে হাকেম, হাদীস : ১৫৭৬");
    }
}
