package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a14 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a14);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("যেসব কারণে কাযা ও কাফফারা উভয়টি জরুরি\n" +
                "\n" +
                "মাসআলা : রমযানে রোযা রেখে দিনে স্ত্রী সহবাস করলে বীর্যপাত না হলেও স্বামী-স্ত্রী উভয়ের উপর কাযা ও কাফফারা ওয়াজিব হবে।\n" +
                "\n" +
                "একটি দীর্ঘ হাদীসে আছে, এক ব্যক্তি রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর নিকট এসে বলল, আমি রোযা অবস্থায় স্ত্রী সহবাস করেছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে কাফফারা আদায়ের নির্দেশ দিয়েছেন। দেখুন : সহীহ বুখারী ৬৭০৯; জামে তিরমিযী ৭২৪; মুসান্নাফে আবদুর রাযযাক ৭৪৫৭; মুসনাদে আহমদ ২/২৪১\n" +
                "\n" +
                "মুহাম্মাদ ইবনে কা’ব রা. বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঐ ব্যক্তিকে (যে স্ত্রীসহবাসে লিপ্ত হয়েছিল) কাফফারা আদায়ের সাথে কাযা আদায়েরও আদেশ করেছিলেন।-মুসান্নাফে আবদুর রাযযাক, হাদীস ৭৪৬১; আলবাহরুর রায়েক ২/২৭৬\n" +
                "\n" +
                "মাসআলা : রোযা রেখে স্বাভাবিক অবস্থায় ইচ্ছাকৃতভাবে পানাহার করলে কাযা ও কাফফারা উভয়টি জরুরি হবে।\n" +
                "\n" +
                "হাদীস শরীফে আছে-\n" +
                "\n" +
                "এক ব্যক্তি রমযানে রোযা রেখে (ইচ্ছাকৃতভাবে) পানাহার করল। তখন রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাকে আদেশ করলেন, যেন একটি দাস আযাদ করে বা দুই মাস রোযা রাখে বা ষাটজন মিসকীনকে খানা খাওয়ায়।-সুনানে দারাকুতনী ২/১৯১\n" +
                "\n" +
                "ইমাম যুহরী রাহ. বলেন, ‘রমযানে রোযা রেখে যে ইচ্ছাকৃতভাবে পানাহার করবে তার হুকুম ইচ্ছাকৃতভাবে দিনে সহবাসকারীর অনুরূপ।’ অর্থাৎ তাকে কাযা ও কাফফারা উভয়টি আদায় করতে হবে।-মাবসূত, সারাখসী ৩/৭৩; আলবাহরুর রায়েক ২/২৭৬\n" +
                "\n" +
                "মাসআলা : বিড়ি-সিগারেট, হুক্কা পান করলেও রোযা ভেঙ্গে যাবে এবং কাযা ও কাফফারা উভয়টি জরুরি হবে।-রদ্দুল মুহতার ৩/৩৮৫\n" +
                "\n" +
                "এই মাসআলার দলীল বিষয়ক বিস্তারিত আলোচনার জন্য দেখুন : ঝাজরু আরবাবির রায়্যান আন শুরবিদ দুখান; তারবীহুল জিনান বিতাশরীহি হুকমি শুরবিদ দুখান, আল্লামা আবদুল হাই লাখনোবী রাহ.\n" +
                "\n" +
                "মাসআলা : সুবহে সাদিক হয়ে গেছে জানা সত্ত্বেও আযান শোনা যায়নি বা এখনো ভালোভাবে আলো ছড়ায়নি এ ধরনের ভিত্তিহীন অজুহাতে খানাপিনা করলে বা স্ত্রী সহবাসে লিপ্ত হলে কাযা-কাফফারা দু’টোই জরুরি হবে।-সূরা বাকারা : ১৮৭; মাআরিফুল কুরআন ১/৪৫৪-৪৫৫");
    }
}
