package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a16 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a16);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("মাসআলা : অযু বা গোসলের সময় রোযার কথা স্মরণ থাকা অবস্থায় অনিচ্ছাকৃতভাবে গলার ভেতর পানি চলে গেলে রোযা ভেঙ্গে যাবে। তাই রোযা অবস্থায় অযু-গোসলের সময় নাকের নরম স্থানে পানি পৌঁছানো এবং গড়গড়াসহ কুলি করবে না।\n" +
                "\n" +
                "লাকিত ইবনে সাবিরা রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেন-\n" +
                "\n" +
                "بالغ في الاستنشاق، إلا أن تكون صائما.\n" +
                "\n" +
                " ‘(অযু-গোসলের সময়) ভালোভাবে নাকে পানি দাও তবে রোযা অবস্থায় নয়।’-সুনানে আবু দাউদ, হাদীস : ২৩৬৩ সুনানে তিরমিযী, হাদীস : ৭৮৫\n" +
                "\n" +
                "সুফিয়ান সাওরী রাহ. বলেন, ‘রোযা অবস্থায় কুলি করতে গিয়ে অনিচ্ছাকৃতভাবে গলার ভেতর পানি চলে গেলে রোযা ভেঙ্গে যাবে এবং তা কাযা করতে হবে।-মুসান্নাফে আবদুর রাযযাক, হাদীস : ৭৩৮০\n" +
                "\n" +
                "আরো দেখুন : মুসান্নাফে ইবনে আবী শাইবা, হাদীস ৯৮৪৪-৯৮৪৭; ফাতাওয়া শামী ২/৪০১\n" +
                "\n" +
                "মাসআলা : যা সাধারণত আহারযোগ্য নয় বা কোনো উপকারে আসে না, তা খেলেও রোযা ভেঙ্গে যাবে এবং কাযা করতে হবে। আবদুল্লাহ ইবনে আববাস রা. ও ইকরিমা রাহ. বলেন, ‘(পেটে) কোনো কিছু প্রবেশ করলে রোযা ভেঙ্গে যায়। কোনো কিছু বের হওয়ার দ্বারা রোযা ভাঙ্গে না।’-সহীহ বুখারী ১/২৬০ (তা’লীক); বাদায়েউস সানায়ে ২/২৫৫; রদ্দুল মুহতার ২/৪১০\n" +
                "\n" +
                "মাসআলা : দাঁত থেকে রক্ত বের হয়ে যদি তা থুথুর সাথে ভেতরে চলে যায় তবে রক্তের পরিমাণ থুথুর সমান বা বেশি হলে রোযা ভেঙ্গে যাবে।-আলবাহরুর রায়েক ২/২৭৩; রদ্দুল মুহতার ২/৩৯৬\n" +
                "\n" +
                "মাসআলা : হস্তমৈথুনে বীর্যপাত হলে রোযা ভেঙ্গে যাবে। আর এটা যে ভয়াবহ গুনাহের কাজ তা বলাই বাহুল্য।\n" +
                "\n" +
                "হাদীস শরীফে কামেচ্ছা চরিতার্থ করা থেকে বিরত থাকাকে রোযার অংশ হিসেবে উল্লেখ করা হয়েছে। ইরশাদ হয়েছে, ঐ সত্ত্বার কসম, যার হাতে আমার জান। রোযাদারের মুখের গন্ধ আল্লাহ তাআলার নিকট মেশকের চেয়েও বেশি প্রিয় (আল্লাহ তাআলা বলেন,) রোযাদার আমার জন্য পানাহার করা থেকে এবং কামেচ্ছা চরিতার্থ করা থেকে বিরত থাকে।-সহীহ বুখারী ১/২৫৪; আলবাহরুর রায়েক ২/২৭২; ফাতাওয়া শামী ২/৩৯৯\n" +
                "\n" +
                "মাসআলা : মুখে বমি চলে আসার পর  ইচ্ছাকৃতভাবে গিলে ফেললে রোযা ভেঙ্গে যাবে। যদিও তা পরিমাণে অল্প হয়।-আলবাহরুর রায়েক ২/২৭৪; আদ্দুররুল মুখতার ২/৪১৫\n" +
                "\n" +
                "মাসআলা : রোযা অবস্থায় হায়েয বা নেফাস শুরু হলে রোযা ভেঙ্গে যাবে। পরে তা কাযা করতে হবে।\n" +
                "\n" +
                "আবু সাঈদ খুদরী রা. থেকে বর্ণিত একটি দীর্ঘ হাদীসে আছে, নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঈদুল ফিতর বা ঈদুল আযহায় মহিলাদের লক্ষ্য করে বললেন-\n" +
                "\n" +
                "أليس إذا حاضت لم تصل ولم تصم قلن بلى، قال : فذلك من نقصان دينها.\n" +
                "\n" +
                "মহিলারা তো ঋতুস্রাবের সময় রোযা রাখতে পারে না এবং নামাযও পড়তে পারে না। এটা তোমাদের দ্বীনের অসম্পূর্ণতা।-সহীহ বুখারী ১/৪৪; শরহু মুখতাসারিত তহাবী ২/৪৪০; আননুতাফ ফিলফাতাওয়া ১০০\n" +
                "\n" +
                "* পেটের এমন ক্ষতে ওষুধ লাগালে রোযা ভেঙ্গে যাবে, যা দিয়ে ওষুধ পেটের ভেতর চলে যায়। বিশেষ প্রয়োজনে এমন ক্ষতে ওষুধ লাগালে পরে সে রোযার কাযা করে নিতে হবে।-ফাতাওয়া হিন্দিয়া ১/২০৪; রদ্দুল মুহতার ২/৪০২\n" +
                "\n" +
                "* নাকে ওষুধ বা পানি দিলে তা যদি গলার ভেতরে চলে যায় তাহলে রোযা ভেঙ্গে যাবে এবং কাযা করতে হবে।\n" +
                "\n" +
                "* মলদ্বারের ভেতর ওষুধ বা পানি ইত্যাদি গেলে রোযা ভেঙ্গে যাবে।\n" +
                "\n" +
                "আবদুল্লাহ ইবনে আববাস রা. থেকে বর্ণিত-\n" +
                "\n" +
                "ذكر عنده الوضوء من الطعام، قال الأعمش مرة والحجامة للصائم، فقال : إنما الوضوء مما يخرج وليس مما يدخل، وإنما الفطر مما دخل وليس مما خرج.\n" +
                "\n" +
                "শরীর থেকে (কোনো কিছু) বের হলে অযু করতে হয়, প্রবেশ করলে নয়। পক্ষান্তরে রোযা এর উল্টো।  রোযার ক্ষেত্রে (কোনো কিছু শরীরে) প্রবেশ করলে রোযা ভেঙ্গে যায়, বের হলে নয় (তবে বীর্যপাতের প্রসঙ্গটি ভিন্ন)।-ফাতাওয়া হিন্দিয়া ১/২০৪; রদ্দুল মুহতার ২/৪০২\n" +
                "\n" +
                "মাসআলা : সুবহে সাদিকের পর সাহরীর সময় আছে ভেবে পানাহার বা স্ত্রীসঙ্গম করলে রোযা  ভেঙ্গে যাবে। তেমনি ইফতারির সময় হয়ে গেছে ভেবে  \n" +
                "\n" +
                "সূর্যাস্তের পূর্বে ইফতার করে নিলে রোযা নষ্ট হয়ে যাবে।-আদ্দুররুল মুখতার ২/৪০৫; আলবাহরুর রায়েক ২/২৯১\n" +
                "\n" +
                "মাসআলা : রোযা রাখা অবস্থায় ভুলবশত পানাহার করে রোযা নষ্ট হয়ে গেছে ভেবে ইচ্ছাকৃতভাবে পানাহার করলে রোযা নষ্ট হয়ে যাবে এবং কাযা করা জরুরি হবে।\n" +
                "\n" +
                "* অনিচ্ছাকৃত বমি হওয়ার কারণে রোযা নষ্ট হয়ে গেছে মনে করে রোযা ভেঙ্গে ফেললে কাযা করতে হবে।\n" +
                "\n" +
                "আউন রাহ. থেকে বর্ণিত, মুহাম্মাদ ইবনে সীরীন রাহ. রাত্র বাকি আছে ভেবে সাহরী খেলেন। তারপর জানতে পারলেন, তিনি সুবহে সাদিকের পর সাহরী করেছেন তখন তিনি বললেন, ‘আমি আজ রোযাদার নই।’ (অর্থাৎ আমাকে এ রোযার কাযা করতে হবে)।-মুসান্নাফে ইবনে আবী শাইবা ৬/১৪৯\n" +
                "\n" +
                "আলী ইবনে হানযালা তার পিতা থেকে বর্ণনা করেন, তিনি রোযার মাসে ওমর রা.-এর নিকট ছিলেন। তার নিকট পানীয় পেশ করা হল। উপস্থিত লোকদের কেউ কেউ সূর্য ডুবে গেছে ভেবে তা পান করে ফেলল। এরপর মুয়াযযিন আওয়াজ দিল, আমীরুল মুমিনীন! সূর্য এখনো ডুবেনি। তখন ওমর রা. বললেন, ‘যারা ইফতারি করে ফেলেছে তারা একটি রোযা কাযা করবে। আর যারা ইফতারি করেনি তারা সূর্যাস্ত পর্যন্ত অপেক্ষা করুন।’-মুসান্নাফে ইবনে আবী শাইবা ৬/১৫০; আদ্দুররুল মুখতার ২/৪০১; ফাতাওয়া হিন্দিয়া ১/২০৬");
    }
}
