package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a17 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a17);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("এমন কিছু কাজ আছে, যার দ্বারা রোযার কোনো ক্ষতি হয় না। অথচ অনেকে এগুলোকে রোযা ভঙ্গের কারণ মনে করে। ফলে এমন কোনো কাজ হয়ে গেলে রোযা ভেঙে গেছে মনে করে ইচ্ছাকৃত পানাহার করে। পক্ষান্তরে কেউ কেউ এসব কাজ পরিহার করতে গিয়ে অযথা কষ্ট ভোগ করে। সুতরাং এসব বিষয়েও সকল রোযাদার অবগত হওয়া জরুরি।\n" +
                "\n" +
                "মাসআলা : কোনো রোযাদার রোযার কথা ভুলে গিয়ে পানাহার করলে তার রোযা নষ্ট হবে না। তবে রোযা স্মরণ হওয়ামাত্রই পানাহার ছেড়ে দিতে হবে।\n" +
                "\n" +
                "হাদীস শরীফে এসেছে-\n" +
                "\n" +
                "من نسي وهو صائم فأكل أو شرب فليتم صومه، فإنما أطمعه الله وسقاه.\n" +
                "\n" +
                " ‘যে ব্যক্তি ভুলে আহার করল বা পান করল সে যেন তার রোযা পূর্ণ করে। কারণ আল্লাহই তাকে পানাহার করিয়েছেন।’-সহীহ মুসলিম ১/২০২; আলবাহরুর রায়েক ২/২৭১; ফাতাওয়া হিন্দিয়া ১/২০২\n" +
                "\n" +
                "মাসআলা : চোখে ওষুধ-সুরমা ইত্যাদি লাগালে রোযার কোনো ক্ষতি হয় না।\n" +
                "\n" +
                "আনাস রা. রোযা অবস্থায় সুরমা ব্যবহার করতেন।-সুনানে আবু দাউদ ১/৩২৩; ফাতাওয়া হিন্দিয়া ১/২০৩; রদ্দুল মুহতার ২/৩৯৫\n" +
                "\n" +
                "মাসআলা : রাত্রে স্ত্রীসহবাস করলে বা স্বপ্নদোষ হলে সুবহে সাদিকের আগে গোসল করতে না পারলেও রোযার কোনো ক্ষতি হবে না। তবে কোনো ওযর ছাড়া, বিশেষত রোযার হালতে দীর্ঘ সময় অপবিত্র থাকা অনুচিত।\n" +
                "\n" +
                "আয়েশা রা. থেকে বর্ণিত, তিনি বলেন, গোসল ফরয অবস্থায় নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের সকাল হত। অতঃপর তিনি গোসল করে রোযা পূর্ণ করতেন।\n" +
                "\n" +
                "মাসআলা : বীর্যপাত ঘটা বা সহবাসে লিপ্ত হওয়ার আশঙ্কা না থাকলে স্ত্রীকে চুমু খাওয়া জায়েয। তবে কামভাবের সাথে চুমু খাওয়া যাবে না। আর তরুণদের যেহেতু এ আশঙ্কা থাকে তাই তাদের বেঁচে থাকা উচিত।\n" +
                "\n" +
                "আবদুল্লাহ ইবনে আমর ইবনুল আস রা. বলেন, আমরা নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের নিকটে ছিলাম। ইতিমধ্যে একজন যুবক এল এবং প্রশ্ন করল, আল্লাহর রাসূল! আমি কি রোযা অবস্থায় চুম্বন করতে পারি? নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, না। এরপর এক বৃদ্ধ এল এবং একই প্রশ্ন করল। নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, হাঁ। আমরা তখন অবাক হয়ে একে অপরের দিকে তাকাচ্ছিলাম। নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, আমি জানি, তোমরা কেন একে অপরের দিকে তাকাচ্ছ। শোন, বৃদ্ধ ব্যক্তি নিজেকে নিয়ন্ত্রণ করতে পারবে।-মুসনাদে আহমদ ২/১৮০, ২৫০\n" +
                "\n" +
                "আবু মিজলায রাহ. বলেন, আবদুল্লাহ ইবনে আববাস রা.-এর নিকট এক বৃদ্ধ রোযা অবস্থায় চুমু খাওয়ার মাসআলা জিজ্ঞাসা করল। তিনি তাকে অনুমতি দিলেন। অতঃপর এক যুবক এসে একই মাসআলা জিজ্ঞাসা করলে তিনি তাকে নিষেধ করলেন।-মুসান্নাফে আবদুর রাযযাক ৪/১৮৫; খুলাসাতুল ফাতাওয়া ১/২৬০; ফাতাওয়া হিন্দিয়া ১/২০০\n" +
                "\n" +
                "মাসআলা : অনিচ্ছাকৃত বমি হলে (মুখ ভরে হলেও) রোযা ভাঙ্গবে না। তেমনি বমি মুখে এসে নিজে নিজে ভেতরে চলে গেলেও রোযা ভাঙ্গবে না।\n" +
                "\n" +
                "হাদীস শরীফে আছে, অর্থ : অনিচ্ছাকৃতভাবে কোনো ব্যক্তির বমি হলে তার রোযা কাযা করতে হবে না।-জামে তিরমিযী ১/১৫৩, হাদীস : ৭২০; আলবাহরুর রায়েক ২/২৭৪; রদ্দুল মুহতার ২/৪১৪\n" +
                "\n" +
                "মাসআলা : শরীর বা মাথায় তেল ব্যবহার করলে রোযা ভাঙ্গবে না।\n" +
                "\n" +
                "কাতাদাহ রাহ. বলেন, ‘রোযাদারের তেল ব্যবহার করা উচিত, যাতে রোযার কারণে সৃষ্ট ফ্যাকাশে বর্ণ দূর হয়ে যায়।-মুসান্নাফে আবদুর রাযযাক ৪/৩১৩; আদ্দুররুল মুখতার ২/৩৯৫; আলবাহরুর রায়েক ২/১৭৩\n" +
                "\n" +
                "মাসআলা : শুধু যৌন চিন্তার কারণে বীর্যপাত হলে রোযা ভাঙ্গবে না। তবে এ কথা বলাই বাহুল্য যে, সব ধরনের কুচিন্তা তো এমনিতেই গুনাহ আর রোযার হালতে তো তা আরো বড় অপরাধ।-ফাতাওয়া হিন্দিয়া ১/২০৪; রদ্দুল মুহতার ২/৩৯৬\n" +
                "\n" +
                "* কামভাবের সাথে কোনো মহিলার দিকে তাকানোর ফলে কোনো ক্রিয়া-কর্ম ছাড়াই বীর্যপাত হলে রোযা ভাঙ্গবে না। তবে রোযা অবস্থায় স্ত্রীর দিকেও এমন দৃষ্টি দেওয়া অনুচিত। আর অপাত্রে কু-দৃষ্টি তো গুনাহ। যা রোযা অবস্থায় আরো ভয়াবহ। এতে ঐ ব্যক্তি রোযার ফযীলত ও বরকত থেকে মাহরূম হয়ে যায়।\n" +
                "\n" +
                "জাবির ইবনে যায়েদকে জিজ্ঞাসা করা হয়েছে, কোন ব্যক্তি তার স্ত্রীর দিকে কামভাবের সাথে তাকানোর ফলে বীর্যপাত ঘটেছে, তার কি রোযা ভেঙ্গে গেছে? তিনি বললেন, ‘না। সে রোযা পূর্ণ করবে।’-মুসান্নাফে ইবনে আবী শাইবা ৬-২৫৯ আরো দেখুন : সহীহ বুখারী ১/২৫৮; ফাতাওয়া হিন্দিয়া ১/২০৪; ফাতাওয়া শামী ২/৩৯৬\n" +
                "\n" +
                "মাসআলা : মশা-মাছি, কীট-পতঙ্গ ইত্যাদি অনিচ্ছাকৃত পেটের ভেতর ঢুকে গেলেও রোযা ভাঙ্গবে না।\n" +
                "\n" +
                "* অনুরূপ ধোঁয়া বা ধুলোবালি অনিচ্ছাকৃতভাবে গলা বা পেটের ভেতর ঢুকে গেলে রোযা ভাঙ্গবে না।\n" +
                "\n" +
                "আবদুল্লাহ ইবনে আববাস রা. বলেন, ‘কারো গলায় মাছি ঢুকে গেলে রোযা ভাঙ্গবে না।’-মুসান্নাফে ইবনে আবী শাইবা ৬/৩৪৯; রদ্দুল মুহতার ২/৩৯৫; ফাতাওয়া হিন্দিয়া ১/২০৩\n" +
                "\n" +
                "মাসআলা : স্বপ্নদোষ হলে রোযা ভাঙ্গবে না।\n" +
                "\n" +
                "আবু সাঈদ খুদরী রা. থেকে বর্ণিত, নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের মুখ ভরে বমি হল। তিনি তখন বললেন-\n" +
                "\n" +
                "ثلاث لا يفطرن الصائم : القيء، والحجامة، والحلم.\n" +
                "\n" +
                "তিন বস্ত্ত রোযাভঙ্গের কারণ নয় : বমি, শিঙ্গা লাগানো ও স্বপ্নদোষ।-সুনানে কুবরা, বাইহাকী ৪/২৬৪\n" +
                "\n" +
                "মাসআলা : চোখের দু’ এক ফোটা পানি মুখে চলে গেলে রোযার ক্ষতি হয় না। তবে তা যদি গলার ভেতর চলে যায় তাহলে রোযা ভেঙ্গে যাবে।-আলমুহীতুল বুরহানী ৩/৩৪৯; ফাতাওয়া হিনিদয়া ১/২০৩\n" +
                "\n" +
                "মাসআলা : সুস্থ অবস্থায় রোযার নিয়ত করার পর যদি অজ্ঞান বা অচেতন হয়ে যায় তাহলে রোযা নষ্ট হবে না।\n" +
                "\n" +
                "নাফে রাহ. বলেন, আবদুল্লাহ ইবনে ওমর রা. নফল রোযা অবস্থায় বেহুশ হয়ে যান কিন্তু এ কারণে রোযা ভাঙ্গেননি।-সুনানে কুবরা, বাইহাকী ৪/২৩৫; আলমুহীতুল বুরহানী ৩/৩৬৮; মাবসূত, সারাখসী ৩/৮৮");
    }
}
