package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a18 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a18);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("১. মুসাফির\n" +
                "\n" +
                "মাসআলা : মুসাফিরের জন্য সফরের হালতে রোযা না রাখার সুযোগ রয়েছে। তবে অস্বাভাবিক কষ্ট না হলে রোযা রাখাই উত্তম। আর অস্বাভাবিক কষ্ট হলে রোযা রাখা মাকরূহ। এ অবস্থায় রোযা না রেখে পরে তা কাযা করবে।\n" +
                "\n" +
                "আছিম রাহ. বলেন, আনাস রা.কে সফরকালে রোযা রাখার বিষয়ে জিজ্ঞাসা করা হলে তিনি বললেন, ‘যে রোযা রাখবে না সে অবকাশ গ্রহণ করল। আর যে রোযা রাখল সে উত্তম কাজ করল।’-মুসান্নাফে ইবনে আবী শাইবা ৬/১৩২; রদ্দুল মুহতার ২/৪২১; ফাতাওয়া তাতারখানিয়া ৩/৪০৩\n" +
                "\n" +
                "মাসআলা : সফরের হালতে রোযা রাখা শুরু করলে তা আর ভাঙ্গা জায়েয নয়। কেউ ভেঙ্গে ফেললে গুনাহগার হবে। তবে কাফফারা আসবে না। শুধু কাযাই যথেষ্ট।\n" +
                "\n" +
                "আনাস রা. বলেন, ‘কেউ রোযা রেখে সফরে বের হলে রোযা ভাঙ্গবে না। তবে যদি পিপাসার কারণে প্রাণনাশের আশঙ্কা হয় তাহলে রোযা ভাঙ্গতে পারবে, পরে তা কাযা করে নিবে।-ফাতাওয়া তাতারখানিয়া ৩/৪০৩; রদ্দুল মুহতার ২/৪৩১\n" +
                "\n" +
                "মাসআলা : মুসাফির সফরের কারণে রোযা রাখেনি, কিন্তু দিন শেষ হওয়ার আগেই মুকীম হয়ে গেল। তাহলে দিনের অবশিষ্ট সময় রমযানের মর্যাদা রক্ষার্থে পানাহার থেকে বিরত থাকা ওয়াজিব। তবে পরবর্তী সময়ে এ রোযার কাযা অবশ্যই করতে হবে।\n" +
                "\n" +
                "ইবরাহীম নাখায়ী রাহ. বলেন, যে মুসাফির রমযানের দিনে (সফরের হালতে) খানা খেয়েছে সে মুকীম হয়ে গেলে দিনের বাকি অংশ পানাহার থেকে বিরত থাকবে।-মুসান্নাফে ইবনে আবী শাইবা ৬/২২১; আলবাহরুর রায়েক ২/২৯১; ফাতাওয়া তাতারখানিয়া ৩/৪২৮\n" +
                "\n" +
                "মাসআলা : রমযানের দিনে হায়েয-নেফাস থেকে পবিত্র হলে অবশিষ্ট দিন রমযানের মর্যাদা রক্ষার্থে পানাহার থেকে বিরত থাকা ওয়াজিব। তবে উক্ত ওযরে ছুটে যাওয়া রোযাগুলোর সাথে এ দিনের রোযাও কাযা করবে।\n" +
                "\n" +
                "হাসান রা. বলেন, ‘সুবহে সাদিকের পর যে হায়েয থেকে পবিত্র হয়েছে সে দিনের বাকি অংশে পানাহার করবে না।’-মুসান্নাফে ইবনে আবী শাইবা ৬/২২১; ফাতাওয়া তাতারখানিয়া ৩/৪২৮; আলবাহরুর রায়েক ২/২৯১\n" +
                "\n" +
                "২. অসুস্থ ব্যক্তি\n" +
                "\n" +
                "মাসআলা : রোযার কারণে যে রোগ বৃদ্ধি পায় বা রোগ-ভোগ দীর্ঘ হওয়ার প্রবল আশঙ্কা থাকে সে রোগে রোযা ভাঙ্গার অবকাশ আছে। উল্লেখ্য, আশঙ্কা যদি সুস্পষ্ট হয় তাহলে তো কথা নেই। নতুবা একজন অভিজ্ঞ ও দ্বীনদার চিকিৎসকের মতামতের প্রয়োজন হবে।-আলমুহীতুল বুরহানী ৩/৩৫৯; আদ্দুররুল মুখতার ২/৪২২\n" +
                "\n" +
                "৩. গর্ভবতী\n" +
                "\n" +
                "মাসআলা : রোযা রাখার কারণে গর্ভবতী মহিলা নিজের কিংবা সন্তানের প্রাণহানী বা মারাত্মক স্বাস্থ্যহানীর প্রবল আশঙ্কা করলে তার জন্য রোযা ভঙ্গ করা জায়েয। পরে এ রোযা কাযা করে নিবে।-আলমুহীতুল বুরহানী ৩/৩৫৯; আদ্দুররুল মুখতার ২/৪২২\n" +
                "\n" +
                "৪. দুগ্ধদানকারিনী\n" +
                "\n" +
                "মাসআলা : দুগ্ধদানকারিনী মা রোযা রাখলে যদি সন্তান দুধ না পায় আর ঐ সন্তান অন্য কোনো খাবারেও অভ্যস্ত না হয়, ফলে দুধ না পাওয়ার কারণে\n" +
                "\n" +
                "সন্তানের মৃত্যুর বা মারাত্মক স্বাস্থ্যহানীর আশঙ্কা হয়, তাহলে তিনি রোযা ভাঙ্গতে পারবেন এবং পরে কাযা করে নিবেন। হাদীস শরীফে ইরশাদ হয়েছে, অর্থ : আল্লাহ তাআলা মুসাফিরের জন্য রোযার হুকুম শিথিল করেছেন এবং আংশিক নামায কমিয়ে দিয়েছেন। আর গর্ভবতী ও দুগ্ধদানকারিনীর জন্যও রোযার হুকুম শিথিল করেছেন।-জামে তিরমিযী ১/১৫২; আলমুহীতুল বুরহানী ৩/৩৫৯; আদ্দুররুল মুখতার ২/৪২২\n" +
                "\n" +
                "৫. দুর্বল বৃদ্ধ ব্যক্তি\n" +
                "\n" +
                "মাসআলা : বার্ধক্যজনিত কারণে রোযা রাখতে সক্ষম না হলে রোযা না রাখার অনুমতি রয়েছে। এক্ষেত্রে প্রত্যেক রোযার পরিবর্তে একজন গরীবকে দুবেলা খাবার খাওয়াবে অথবা পৌনে দু কেজি গমের মূল্য সদকা করবে।\n" +
                "\n" +
                "আল্লাহ তাআলা বলেন-\n" +
                "\n" +
                "وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ\n" +
                "\n" +
                "আর যাদের রোযা রাখা অত্যন্ত কষ্টকর তারা ফিদয়া-একজন মিসকীনকে খাবার প্রদান করবে।-সূরা বাকারা : ১৮৪; আলমুহীতুল বুরহানী ৩/৩৬১; ফাতাওয়া হিন্দিয়া ১/২০৭");
    }
}
