package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a19 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a19);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("মাসআলা : রোযা অবস্থায় কুলি করার সময় গড়গড়া করা এবং নাকের নরম অংশ পর্যন্ত পানি পৌঁছানো মাকরূহ।\n" +
                "\n" +
                "লাকিত ইবনে সবিরা রা. থেকে বর্ণিত, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন-\n" +
                "\n" +
                "بالغ في الاستنشاق، إلا أن تكون صائما.\n" +
                "\n" +
                " (অযু-গোসলের) সময় ভালোভাবে নাকে পানি দাও, তবে রোযাদার হলে নয়।-জামে তিরমিযী, হাদীস: ৭৬৬; সুনানে আবু দাউদ ১/৩২২; মুসান্নাফে ইবনে আবী শায়বা, হাদীস : ৯৮৪৪; ফাতাওয়া তাতারখানিয়া ৩/৩৯৫; ফাতাওয়া হিন্দিয়া ১/১৯৯\n" +
                "\n" +
                "মাসআলা : এমন কাজ করা মাকরূহ, যার দ্বারা রোযাদার নিতান্তই দুর্বল হয়ে পড়ে। যেমন শিঙ্গা লাগানো।-আলমুহীতুল\n" +
                "\n" +
                "বুরহানী ৩/৩৫৬; ফাতাওয়া হিন্দিয়া ১/২০০\n" +
                "\n" +
                "মাসআলা : রোযা অবস্থায় শরীর থেকে রক্ত বের হলে বা ইনজেকশন ইত্যাদি দ্বারা রক্ত বের করলে রোযা ভাঙ্গবে না। তবে ইচ্ছাকৃতভাবে এ পরিমাণ রক্ত বের করা মাকরূহ, যার দ্বারা রোযাদার খুব দুর্বল হয়ে যায়।\n" +
                "\n" +
                "সাবেত আলবুনানী রাহ. বলেন, আনাস রা. কে জিজ্ঞাসা করা হল রোযার হালতে শিঙ্গা লাগানোকে আপনারা কি মাকরূহ মনে করতেন? তিনি বলেন, ‘না। তবে এ কারণে দুর্বল হয়ে পড়লে তা মাকরূহ হবে।’-সহীহ বুখারী, হাদীস ১৯৪০; আলমুহীতুল বুরহানী ৩/৩৫৬; রদ্দুল মুহতার ২/৩৯৫\n" +
                "\n" +
                "মাসআলা : রোযার হালতে গীবত করলে, গালি-গালাজ করলে, টিভি-সিনেমা ইত্যাদি দেখলে, গান-বাদ্য শ্রবণ করলে এবং যে কোনো বড় ধরনের গুনাহে লিপ্ত হলে রোযা মাকরূহ হয়ে যায়। আর এ কাজগুলো যে সর্বাবস্থায় হারাম, তা তো বলাই বাহুল্য।\n" +
                "\n" +
                "হাদীসে কুদসীতে আছে, আল্লাহ তাআলা ইরশাদ করেছেন-\n" +
                "\n" +
                "إذا كان يوم صوم أحدكم فلا يرفث ولا يصخب.\n" +
                "\n" +
                " ‘তোমাদের কেউ যখন রোযা রাখে তখন সে যেন অশ্লীল কথা না বলে এবং শোরগোল, হট্টগোলে লিপ্ত না হয়।-সহীহ বুখারী হাদীস : ১৯০৪;\n" +
                "\n" +
                "সুনানে আবু দাউদের রেওয়ায়েতে এ শব্দ রয়েছে, ‘রোযাদার যেন কোনো অন্যায়-অপরাধে লিপ্ত না হয়।’ হাদীস : ৩৩৬৩ (১/৩২২)\n" +
                "\n" +
                "হযরত আবু হুরায়রা রা. বলেন, নবী  কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেন, যে ব্যক্তি মিথ্যা-প্রতারণা ও গুনাহের কাজ ত্যাগ করে না আল্লাহ তাআলার নিকট তার পানাহার থেকে বিরত থাকার কোনো মূল্য নেই।’-সহীহ বুখারী, হাদীস ১৯০৩; সুনানে আবু দাউদ, হাদীস : ৩৩৬২ (১/৩২২) ");
    }
}
