package com.example.romadanapp;
import android.os.Bundle;
import android.widget.TextView;

import androidx.appcompat.app.AppCompatActivity;

public class a2 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a2);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("1=> রোযা : রমযান মাসে রোযা রাখা ফরয। এটা এ মাসের বিশেষ আমল। সকল আদব রক্ষা করে পুরো মাস রোযা রাখা প্রত্যেক মুসলিমের কর্তব্য।\n" +
                "\n" +
                "2=>  তারাবীহ : রমযানের রাতের বিশেষ আমল হল কিয়ামে রমযান তথা বিশ রাকাত তারাবীহ। এ মাসের অফুরন্ত রহমত ও মাগফিরাত লাভ করার জন্য এবং প্রতিশ্রুত ছওয়াব ও পুরস্কার পাওয়ার জন্য তারাবী নামাযের প্রভাব অপরিসীম।\n" +
                "\n" +
                "3=>  দান করা : দান-সদকা সর্বাবস্থাতেই উৎকৃষ্ট আমল, কিন্তু রমযানে তার গুরুত্ব অনেক বেড়ে যায়। হাদীস শরীফে এসেছে- ‘রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম দুনিয়ার সকল মানুষ অপেক্ষা অধিক দানশীল ছিলেন। রমযান মাসে তাঁর দানের হস্ত আরো প্রসারিত হত।’ -সহীহ বুখারী, হাদীস ১৯০২\n" +
                "\n" +
                "4=> কুরআন মজীদ তেলাওয়াত : এ মাস কুরআন অবতরণের মাস। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম জিবরীল আ.-এর সাথে রমযানের প্রত্যেক রাতে কুরআন মজীদ দাওর করতেন। হাদীস শরীফে এসেছে- ‘হযরত জিবরীল আ. রমযানের শেষ পর্যন্ত প্রত্যেক রাতে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম-এর সাথে সাক্ষাত করতেন এবং রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম তাঁকে কুরআন মজীদ শোনাতেন।’-সহীহ বুখারী, হাদীস ১৯০২ অতএব আমাদের প্রত্যেকের উচিত রমযানে অধিক পরিমাণে কুরআন তেলাওয়াত করা। অন্তত একবার হলেও কুরআন মজীদ খতম করা। সালাফে সালেহীনের জীবনী আলোচনা করলে দেখা যায় যে, তাঁরা এবং পরিবারের সদস্যগণ প্রত্যেকে রমযানে বহুবার কুরআন মজীদ খতম করতেন।\n" +
                "\n" +
                "5=> নফল ইবাদত : এ মাসে শয়তান শৃংখলাবদ্ধ থাকে। এই সুযোগে অধিক পরিমাণে নফল ইবাদতের মাধ্যমে আল্লাহ তাআলার নৈকট্য অর্জন করা যায়। এ মাসে যে কোনো ইবাদত নিয়মিত করতে তেমন কোনো বেগ পেতে হয় না এবং পরবর্তীতে তা সহজেই অভ্যাসে পরিণত হয়। সুতরাং যিকির-আযকারের সঙ্গে অধিক পরিমাণে নফল নামায আদায় করা উচিত। অন্তত বিভিন্ন সময়ের নফল নামাযগুলো আদায় করা যেমন-ইশরাক, চাশত ও তাহাজ্জুদ ইত্যাদি।আফসোসের বিষয় এই যে, রমযানে সাহরীতে উঠলেই দু’চার রাকাত তাহাজ্জুদ নামায সহজেই পড়া যায়। বছরের অন্য দিনের মতো কষ্ট করার প্রয়োজন হয় না। কিন্তু অমনোযোগী হওয়ার ফলে কিংবা সাহরীতে অতি ভোজনের কারণে তাহাজ্জুদ আদায়ের সুযোগ হয়ে ওঠে না।\n" +
                "\n" +
                "6=>  দুআ করা : এ মাস রহমত, বরকত, মাগফিরাত ও জান্নাত লাভের মাস। তাই বেশি বেশি আল্লাহ তাআলার শরণাপন্ন হয়ে কান্না-কাটি করে দুআ করা একান্ত কাম্য।\n" +
                "\n" +
                "7=> মাগফিরাত কামনা করা : যে ব্যক্তি রমযান পেয়েও স্বীয় গুনাহসমূহ ক্ষমা করাতে পারল না তার উপর জিবরীল আ. ও দয়ার নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম অভিসম্পাত করেছেন। তাই জীবনের কৃত গুনাহের কথা স্মরণ করে বেশি বেশি তওবা ইস্তেগফার করা এবং আল্লাহ তাআলার দরবারে ক্ষমা মঞ্জুর করিয়ে নেওয়ার এটিই উত্তম সময়। বিশেষ করে ইফতার ও তাহাজ্জুদের সময় আল্লাহ তাআলার দরবারে ক্ষমা চাওয়া এবং দুআ করা উচিত।\n" +
                "\n" +
                "8=>  ই’তিকাফ : শেষ দশকের মাসনূন ই’তিকাফ অত্যন্ত ফযীলতের আমল। হাদীস শরীফে এসেছে- ‘নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম রমযানের শেষ দশদিন ইতিকাফ করতেন।’ -সহীহ বুখারী, হাদীস ২০২১; সহীহ মুসলিম, হাদীস ১১৭১ ঁ\n" +
                "\n" +
                "9=>  শবে কদর অন্বেষণ : ইবাদত-বন্দেগীর মাধ্যমে রাত্রি জাগরণ করে সহস্র রজনী অপেক্ষা শ্রেষ্ঠ ও উত্তম রাত-লাইলাতুল কদর  তালাশ করা কর্তব্য। কুরআন মজীদে ইরশাদ হয়েছে-‘নিঃসন্দেহে কদরের রাতে আমি কুরআন অবতীর্ণ করেছি। আর আপনি কি জানেন শবে কদর কী? শবে কদর হল এক হাজার মাস অপেক্ষা শ্রেষ্ঠ। এ রাতে ফেরেশতা ও রুহুল কুদ্স (জিবরাঈল আ.) তাদের পালনকর্তার আদেশক্রমে প্রত্যেক মঙ্গলময় বস্ত্ত নিয়ে (পৃথিবীতে) অবতরণ করে। (এ রাতের) আগাগোড়া শান্তি যা ফজর হওয়া পর্যন্ত অব্যাহত থাকে।’ -সূরা কদর");
    }
}