package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a20 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a20);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("মাসআলা : রোযার হালতে প্রয়োজনে জিহবা দ্বারা কোনো কিছুর স্বাদ নেওয়া বা প্রয়োজনে বাচ্চাদের জন্য খাদ্য চিবানো মাকরূহ নয়। তবে সতর্ক থাকতে হবে, যেন স্বাদ গলার ভেতরে চলে না যায়।\n" +
                "\n" +
                "ইবরাহীম নাখায়ী রাহ. রোযাদার মহিলা বাচ্চার জন্য খাদ্য চিবানোকে দোষের বিষয় মনে করতেন না।-মুসান্নাফে আবদুর রাযযাক ৪/২০৭; আলমুহীতুল বুরহানী ৩/৩৫৬; রদ্দুল মুহতার ২/৪১৬\n" +
                "\n" +
                "মাসআলা : রোযাদারের জন্য সুরমা লাগানো বা সুগন্ধি ব্যবহার করা মাকরূহ নয়।\n" +
                "\n" +
                "আতা রাহ. বলেন, ‘রোযাদারের জন্য সুরমা ব্যবহার করাতে দোষ নেই।’-মুসান্নাফে আবদুর রাযযাক ৪/২০৮; আলবাহরুর রায়েক ২/২৮০\n" +
                "\n" +
                "মাসআলা : রোযা অবস্থায়ও মিসওয়াক করা সুন্নত। এমনকি কাঁচা ডাল দ্বারা মিসওয়াক করাও মাকরূহ নয়।\n" +
                "\n" +
                "আমির ইবনে রবীয়া রা. বলেন, নবী কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমি রোযার হালতে অসংখ্যবার মিসওয়াক করতে দেখেছি।-সহীহ বুখারী ১/২৫৯; মুসান্নাফে আবদুর রাযযাক ৪/২০০\n" +
                "\n" +
                "হাসান রাহ.কে রোযা অবস্থায় দিনের শেষে মিসওয়াক করার বিষয়ে জিজ্ঞাসা করা হলে তিনি বলেন, ‘রোযা অবস্থায় দিনের শেষে মিসওয়াক করতে কোনো অসুবিধা নেই। মিসওয়াক পবিত্রতার মাধ্যম। অতএব দিনের শুরুতে এবং শেষেও মিসওয়াক করো।’-মুসান্নাফে আবদুর রাযযাক ৪/২০২\n" +
                "\n" +
                "ইবরাহীম রাহ. বলেন, ‘রোযা অবস্থায় দিনের শুরু ও শেষে মিসওয়াক করতে কোনো অসুবিধা নেই।’-প্রাগুক্ত ৪/২০৩\n" +
                "\n" +
                "মুজাহিদ রাহ. রোযা অবস্থায় তাজা মিসওয়াক ব্যবহার করাকে দোষণীয় মনে করতেন না। সুফিয়ান সাওরী রাহ. থেকেও অনুরূপ বক্তব্য বর্ণিত আছে।-প্রাগুক্ত ৪/২০২; রদ্দুল মুহতার ২/৪১৯; আলবাহরুর রায়েক ২/২৮১");
    }
}
