package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a21 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a21);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("প্রশ্ন: আমি সাহরী খাওয়ার পর দাঁত ব্রাশ করি। প্রায়ই দেখা যায়, এ অবস্থায় আযান হয়ে যায়। জানতে চাই এতে কি আমার রোযার কোনো ক্ষতি হবে?\n" +
                "\n" +
                "উত্তর:রোযা অবস্থায় টুথপেস্ট বা মাজন ব্যবহার করা মাকরূহ তানযীহী। আর যদি তা গলায় বা পেটের ভেতর চলে যায় তবে তো রোযা নষ্টই হয়ে যাবে। তাই সাহরীর সময় শেষ হয়ে গেলে পেস্ট বা মাজন জাতীয় কোনো কিছু ব্যবহার করা থেকে বিরত থাকতে হবে।\n" +
                "রদ্দুল মুহতার ২/৪১৫-৪১৬; ফাতাওয়া খানিয়া ১/২০৪; হিদায়া ১/২২০\n" +
                "\n" +
                "প্রশ্ন: জনৈক ব্যক্তি রমযানের প্রথম রোযার দিন এই নিয়ত করে যে, আমি পূর্ণ এক মাসের রোযা রাখার নিয়ত করলাম। জানার বিষয় হল, উক্ত ব্যক্তির এই নিয়তের দ্বারা পূর্ণ এক মাসের রোযা আদায় হবে কি না? রমযান মাসে আমরা সেহরী খাই কিন্তু রোযার নিয়ত করি না। সেহরী খাওয়ার দ্বারাই কি রোযার নিয়ত হয়ে যাবে?\n" +
                "\n" +
                "উত্তর: রমযান মাসের প্রত্যেক রোযার জন্য প্রতিদিন পৃথক পৃথক নিয়ত করা শর্ত। এক সাথে পুরো মাসের নিয়ত করা যথেষ্ট নয়। তবে রোযার উদ্দেশ্যে সেহরী খাওয়াও রোযার নিয়তের অন্তর্ভুক্ত। মৌখিক নিয়ত করা জরুরি নয়।\n" +
                "-সহীহ বুখারী ১/২; ফাতাওয়া হিন্দিয় ১/১৯৫; ফাতাওয়া খানিয়া ১/২০০-২০১; খুলাসাতুল ফাতাওয়া ১/২৫১; আলবাহরুর রায়েক ২/২৫৯; বাদায়েউস সানায়ে ২/২২৫; আলমুহীতুল বুরহানী ৩/৩৪৪; ফাতাওয়া তাতারখানিয়া ২/৩৫৭; আদ্দুররুল মুখতার ২/৩৭৯\n" +
                "\n" +
                "প্রশ্ন: গত রমযান মাসে একদিন তারাবীর পর আমার খুব বমি হয়। ফলে শরীর প্রচন্ড দুর্বল হয়ে পড়ে। এ কারণে পরের দিন রোযা রাখার নিয়ত করিনি। এমনকি সাহরীও খাইনি। কিন্তু সকাল ৮ টার দিকে ঘুম থেকে উঠে শরীর খুব হালকা বোধ হয়। তাই তখন রোযার নিয়ত করে ফেলি। প্রশ্ন হল, বিলম্বে নিয়ত করায় আমার উক্ত রোযা কি সহীহ হয়েছে? উল্লেখ্য, সুবহে সাদিক থেকে রোযার নিয়ত করা পর্যন্ত রোযা ভঙ্গের কোনো কাজ করা হয়নি।\n" +
                "\n" +
                "উত্তর: রমযানের রোযার নিয়ত সুবহে সাদিক থেকে সূর্যাস্তের মধ্যবর্তী সময়ের পূর্বে করলেও রোযা সহীহ হয়ে যায়। প্রশ্নোক্ত ক্ষেত্রে যেহেতু আপনি এ সময়ের ভেতরেই রোযার নিয়ত করেছেন এবং এর মধ্যে রোযা ভঙ্গের কোনো কাজও করেননি তাই আপনার ঐ রোযা সহীহ হয়েছে। অবশ্য রাতেই রোযার নিয়ত করে নেওয়া উত্তম।\n" +
                "প্রকাশ থাকে যে, সাহরী খাওয়া সুন্নত। সাহরী না খেয়ে শুধু নিয়ত করে নিলেও রোযা সহীহ হয়ে যায়।\n" +
                "-শরহু মুখতাসারিত তহাবী ২/৪০১; আদ্দুররুল মুখতার ২/৩৭৭; ফাতাওয়া হিন্দিয়া ১/১৯৫; বাদায়েউস সানায়ে ২/২২৯, ২৬৬; ফাতহুল কাদীর ২/২৩৫; আলবাহরুর রায়েক ২/২৫৯\n" +
                "\n" +
                "প্রশ্ন: আমি প্রতি রমযানেই রোযাগুলো নিয়মিত রাখি। কিন্তু অধিকাংশ রোযাতেই মুখে রোযার নিয়ত উচ্চারণ করি না; বরং রোযা রাখার উদ্দেশ্যে সেহরীর জন্য উঠে সেহরী খেয়ে নেই এবং অন্যান্য ইবাদত-বন্দেগী ঠিক মতো করতে থাকি। এমন করার দ্বারা আমারা রোযাগুলো সহীহ হয়েছে কি না? নাকি আবার কাযা করতে হবে?\n" +
                "\n" +
                "উত্তর: প্রশ্নোক্ত ক্ষেত্রে আপনার রোযা রাখার উদ্দেশ্যে ঘুম থেকে ওঠা ও সেহরী খাওয়াটাই রোযার নিয়তের শামিল। নিয়ত মনের ইচ্ছার নাম, এক্ষেত্রে মুখে উচ্চারণ করা জরুরি নয়। তাই আপনার রোযাগুলো সহীহভাবে আদায় হয়েছে।\n" +
                "-আলবাহরুর রায়েক ২/৪৫২; আলজাওহারুতুন নাইয়্যিরাহ ১/১৭৬; রদ্দুল মুহতার ৩/৩৩৯, ৩৪১; ফাতাওয়া হিন্দিয়া ১/১৯৫\n" +
                "\n" +
                "প্রশ্ন: জনৈক ব্যক্তি ভোরে ঘুম থেকে উঠতে না পারায় সেহরী না খেয়েই সকালে নফল রোযা রাখার নিয়ত করেছে। আমার প্রশ্ন হল, সেহরী না খেয়ে রোযা রাখার দ্বারা রোযাটি হয়েছে কি?\n" +
                "\n" +
                "উত্তর: রোযার জন্য সেহরী খাওয়া জরুরি নয়; বরং মুস্তাহাব। সেহরী না খেলেও রোযা হয়ে যায়। রোযার কোন ক্ষতি হয় না।\n" +
                "-সহীহ বুখারী ১৯২৩; উমদাতুল কারী ১০/৩০০; রদ্দুল মুহতার ২/৪১৯\n" +
                "\n" +
                "প্রশ্ন: রোযা রাখাবস্থায় মুখ ভরে বমি হলে কী রোযা নষ্ট হয়?\n" +
                "\n" +
                "উত্তর: না, রোযা অবস্থায় মুখ ভরে বমি হলেও রোযা ভাঙ্গবে না। তবে ইচ্ছকৃত মুখ ভরে বমি করলে রোযা ভেঙ্গে যাবে। হাদীস শরীফে ইরশাদ হয়েছেÑঅনিচ্ছাকৃতভাবে কোনো ব্যক্তির বমি হলে তাকে সে রোযা কাযা করতে হবে না (অর্থাৎ তার রোযা ভাঙ্গবে না)। আর যে ইচ্ছাকৃত বমি করবে সে যেন রোযার কাযা করে। \n" +
                "-জামে তিরমিযী, হাদীস ৭২০) -মুসান্নাফে ইবনে আবি শাইবা ৬/১৮০; আল বাহরুর রায়েক ২/২৪৭; আলমুহীতুল বুরহানী ৩/৩৪৬\n" +
                "\n" +
                "প্রশ্ন: রোযা অবস্থায় চোখে ড্রপ দেওয়া যাবে কি?\n" +
                "উত্তর: জী, রোযা অবস্থায় চোখে ড্রপ দেওয়া যাবে। এতে রোযার কোন ক্ষতি হবে না। এমনকি ঔষধের স্বাদ বা তিক্ততা গলায় অনুভূত হলেও অসুবিধা নেই। হাদীস শরীফে এসেছে যে, হযরত আনাস রা. রোযা অবস্থায় চোখে সুরমা ব্যবহার করতেন।\n" +
                "সুনানে আবুদাউদ, হাদীস ২৩৭৮; মুসান্নাফে ইবনে আবী শাইবা, হাদীস ৯৩৮৭; কিতাবুল আসল ২/১৭১; আলমুহীতুল বুরহানী ৩/৩৪৮; বাদায়েউস সানায়ে ২/২৪৪\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "ধুমপান করলে রোযা নষ্ট হবে কী না?\n" +
                "উত্তর:\n" +
                "জীহাঁ, রোযা অবস্থায় ইচ্ছাকৃত ধুপমান করলে রোযা নষ্ট হয়ে যাবে। এবং কাযা ও কাফফারা উভয়টি ওয়াজিব হবে। \n" +
                "- ইমদাদুল ফাত্তাহ পৃ. ৩৮১; রদ্দুল মুহতার ২/৩৯৫; হাশিয়াতুত তহতাবী আলাদ্দুর ১/৪৫০\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "‘গীবত করলে রোযা নষ্ট হয়ে যায়’ কথাটি কি সঠিক?\n" +
                "উত্তর:\n" +
                "রোযা অবস্থায় গীবত করলে রোযা ভেঙ্গে যাবে না। তবে রোযার সাওয়াব ও গুণাগুণ নষ্ট হয়ে যাবে। গীবত কবীরা গুনাহ। কুরআন মাজীদ এবং হাদীস শরীফে এর ঘৃণ্যতা ও ভয়াবহতার কথা এসেছে। সাধারণ সময়ই এটি খুবই নিকৃষ্টতম কাজ। আর রমযান মাসে রোযা অবস্থায় এর ভয়াবহতা আরো বেশি। হাদীস শরীফে এসেছে রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেছেনÑরোযা হল (জাহান্নামের আগুন থেকে বাঁচার) ঢাল, যে পর্যন্ত না তাকে বিদীর্ণ করা হয়। জিজ্ঞাসা করা সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম হল কীভাবে রোযা বিদীর্ণ হয়ে যায়? নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বললেন, মিথ্যা বলার দ্বারা অথবা গীবত করার দ্বারা। (আলমুজামুল আওসাত, তাবারানী,হাদীস ৭৮১০; সানানে নাসায়ী, হাদীস ২২৩৫)\n" +
                "মুজাহিদ রহ. বলেন, দুটি অভ্যাস এমন রয়েছে, এ দুটি থেকে যে বেঁচে থাকবে তার রোযা নিরাপদ থাকবে: গীবত ও মিথ্যা।\n" +
                "Ñমুসান্নাফে ইবনে আবী শাইবা, হাদীস ৮৯৮০; ইমদাদুল ফাত্তাহ, পৃ. ৬৭৪; মাজমাউল আনহুর ১/৩৬০\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "গোসলের সময় অনিচ্ছাকৃতভাবে নাকে পানি গেলে কি রোযা ভেঙ্গে যাবে?\n" +
                "উত্তর:\n" +
                "রোযার কথা স্মরণ থাকা অবস্থায় অযু-গোসলের সময় অনিচ্ছাকৃতও যদি গলার ভিতর পানি চলে যায় তবে রোযা ভেঙ্গে যায়। তাই নাকের ভিতর পানি প্রবেশ করার পর যদি তা গলায় চলে যায় তাহলে রোযা ভেঙ্গে যাবে এবং তা কাযা করতে হবে। তবে এক্ষেত্রে কাফফারা লাগবে না।\n" +
                "ইবরাহীম নাখায়ী রাহ. বলেন, রোযা অবস্থায় কুলি করার সময় অথবা নাকে পানি দেওয়ার সময় যদি পানি ভেতরে প্রবেশ করে এবং তা গলায় চলে যায় তবে সে ঐ দিনের রোযা পূর্ণ করবে এবং পরে তা কাযা করে নিবে। Ñকিতাবুল আসার, হাদীস : ২৮৭\n" +
                "আর যদি শুধু নাকে পানি প্রবেশ করে, গলায় না পৌঁছে তবে রোযা ভাঙ্গবে না।\n" +
                "Ñকিতাবুল আসল ২/১৫০, খুলাসাতুল ফাতাওয়া ১৮২৫৩; মাবসূত সারাখসী ৩/৬৬\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "রোযা অবস্থায় রক্ত দিলে কি রোযা নষ্ট হয়ে যাবে?\n" +
                "উত্তর:\n" +
                "না, রোযা অবস্থায় রক্ত দিলে রোযা ভাঙ্গে না। তাই টেস্ট বা পরীক্ষার জন্য রক্ত দেওয়া যাবে। তবে এ পরিমাণ রক্ত দেওয়া মাকরুহ যার কারণে শরীর অধিক দুর্বল হয়ে পড়ে এবং রোযা রাখা কষ্টকর হয়ে যাবে। তাই দুর্বল লোকদের জন্য রোযা অবস্থায় অন্য রোগীকে রক্ত দেওয়া ঠিক নয়। আর এমন সবল ব্যক্তি যে রোযা অবস্থায় অন্যকে রক্ত দিলে রোযা রাখা তার জন্য কষ্টকর হবে না সে রক্ত দিতে পারবে। এতে কোন অসুবিধা নেই।\n" +
                "-সহীহ বুখারী, হাদীস ১৯৩৬, ১৯৪০, আলবাহরুর রায়েক ২/২৭৩; কিতাবুল আসল ২/১৬৮; মাজমাউল আনহুর ১/৩৬০\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "রোযা অবস্থায় কি দাঁত ব্রাশ করা যাবে? এতে কি রোযা নষ্ট হয়ে যাবে?\n" +
                "উত্তর:\n" +
                "রোযা অবস্থায় টুথপেস্ট বা মাজন দিয়ে দাঁত ব্রাশ করা মাকরূহ। আর পেস্ট বা মাজন গলার ভেতর চলে গেলে রোযাই নষ্ট হয়ে যাবে। তাই রোযা অবস্থায় টুথপেস্ট বা মাজন ব্যবহার করা যাবে না। টুথপেস্ট বা মাজন দিয়ে ব্রাশ করতে হলে সাহরীর সময় শেষ হওয়ার আগেই করে নিবে।\n" +
                "-ইমদাদুল ফাতাওয়া ২/১৪১; জাওয়াহিরুল ফিকহ ৩/৫১৮\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "রোযা অবস্থায় যদি কেউ স্যালাইন বা ইঞ্জেকশন নেয় তাহলে কি রোযা ভেঙ্গে যাবে? তেমনি অসুস্থ অবস্থায় কেউ যদি গ্লুকোজ স্যালাইন নেয় তাহলে কি তার রোযা সহীহ হবে?\n" +
                "উত্তর:\n" +
                "স্যালাইন বা ইঞ্জেকশন নিলে রোযা ভাঙ্গে না। তেমনিভাবে অসুস্থতার কারণে গ্লুকোজ স্যালাইন নিলেও রোযার ক্ষতি হবে না। তবে অসুস্থতা ছাড়া গ্লুকোজ স্যালাইন নেওয়া নাজায়েয।\n" +
                "-আলাতে জাদীদা কে শরঈ আহকাম ১৫৩\n" +
                "\n" +
                "প্রশ্ন:\n" +
                "আমার লিভারে ঘা হয়েছে। ডাক্তার আমাকে একমাস পর পর চার বার এন্ডোস্কপি করতে বলেছেন। সামনে রমযান। তাই জানার বিষয় হল, এন্ডোস্কপি করলে কি রোযা ভেঙ্গে যায়?\n" +
                "উত্তর:\n" +
                "এন্ডোস্কপির পাইপের মাধ্যমে পাকস্থলিতে ঔষধ, পানি ইত্যাদি কোনো কিছু যদি না দেওয়া হয় তবে শুধু এন্ডোস্কপির কারণে রোযা ভাঙ্গবে না। কিন্তু এন্ডোস্কপি করার সময় রক্ত বা ময়লার কারণে পাইপের বাল্ব প্রায়ই ঘোলাটে হয়ে যায়। যার কারণে পাইপের মাধ্যমে পানি দিয়ে ঐ বাল্ব পরিষ্কার করতে হয়। এমন হলে রোযা ভেঙ্গে যাবে। তাই যে ডাক্তার পরীক্ষা করবেন তার থেকে জেনে নিতে হবে যে, পাইপের সাথে কোনো ঔষধ দেওয়া হয়েছে কি না বা ভেতরে পানি দেওয়ার প্রয়োজন হয়েছে কি না।\n" +
                "উল্লেখ্য, রমযান মাসে এন্ডোস্কপি করার প্রয়োজন হলে ইফতারের পর করতে চেষ্টা করবেন।\n" +
                "-আলমুহীতুল বুরহানী ৩/৩৪৮; ফাতাওয়া তাতারখানিয়া ২/৩৮০; আলবাহরুর রায়েক ২/২৭৯; ফাতাওয়া হিন্দিয়া ১/২০৪; আদ্দুররুল মুখতার ২/৩৯৭\n" +
                "\n" +
                "প্রশ্ন:আমার প্রস্রাব আটকে যাওয়ার সমস্যা আছে। এজন্য আগে মাঝেমধ্যে ক্যাথেটারও ব্যবহার করতে হয়েছে। সামনে রমযান আসছে, তাই আমি জানতে চাচ্ছি যে, রোযা অবস্থায় ক্যাথেটার ব্যবহার করলে কি রোযা ভেঙ্গে যায়?\n" +
                "\n" +
                "উত্তর:ক্যাথেটার ব্যবহার করলে রোযার ক্ষতি হয় না। সুতরাং রোযা অবস্থায় প্রয়োজন হলে তা ব্যবহার করতে পারবেন।\n" +
                "-মাজাল্লাতু মাজমাইল ফিকহিল ইসলামী সংখ্যা : ১০, ২/৪৫৪; ফিকহুন নাওয়াযিল ২/২৯৭; আলমাকালাতুল ফিকহিয়্যাহ ২১৭; আদ্দুররুল মুখতার ২/৩৯৯; হাশিয়াতুত তহতাবী আলাল মারাকী ৩৬২\n" +
                "\n" +
                "প্রশ্ন:রমযান মাসে অনেক সময় কোনো কোনো রোযাদারকে ভুলে পানাহার করতে দেখা যায়। পানাহারের সময় তাদেরকে বারণ করা বা না করা সম্পর্কে করণীয় কী জানিয়ে বাধিত করবেন।\n" +
                "\n" +
                "উত্তর:রমযান মাসে কোনো সুস' সবল লোককে ভুলে পানাহার করতে দেখলে তাকে রোযার কথা স্মরণ করিয়ে দিবে। তবে কোনো দুর্বল বা বৃদ্ধকে ভুলে পানাহার করতে দেখলে রোযার কথা স্মরণ না করানোই উত্তম।\n" +
                "আলবাহরুর রায়েক ২/২৭১; ফাতাওয়া তাতারখানিয়া ২/৩৮৪; ফাতহুল কাদীর ২/২৫৫; ফাতাওয়া খানিয়া ১/২০৪; তাবয়ীনুল হাকায়েক ১/৩২২; আদ্দুররুল মুখতার ২/৩৯৫");
    }
}
