package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;
public class a3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a3);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("ইসলামের মূল স্তম্ভসমূহের মধ্যে ঈমান, নামায ও যাকাতের পরই রোযার স্থান। হাদীস শরীফে এসেছে-\n" +
                "\n" +
                "‘পাঁচটি স্তম্ভের উপর ইসলামের ভিত্তি স্থাপিত :  আল্লাহ তাআলা এক বলে স্বীকার করা, নামায কায়েম করা, যাকাত প্রদান করা, রমযানের রোযা রাখা ও হজ্জ পালন করা।’ সহীহ মুসলিম ১/৩২\n" +
                "\n" +
                "সুতরাং রমযানের পূর্ণ মাস রোযা রাখা ফরয। আল্লাহ তাআলা ইরশাদ করেন- (তরজমা) ‘হে ঈমানদারগণ! তোমাদের উপর (রমযানের) রোযা ফরয করা হয়েছে, যেভাবে তোমাদের পূর্ববর্তী উম্মতের উপর ফরয  করা হয়েছিল। যেন তোমরা মুত্তাকী হতে পার।’- সূরা বাকারা ১৮৩\n" +
                "\n" +
                "শরয়ী ওযর ছাড়া যে ব্যক্তি ইচ্ছাকৃত একটি রোযাও পরিত্যাগ করে সে নিকৃষ্ট পাপী। দ্বীনের মৌলিক ফরয লংঘনকারী এবং ঈমান ও ইসলামের ভিত্তি বিনষ্টকারীরূপে সে পরিগণিত হবে। আর এ কাজ সে রোযার যে মঙ্গল ও বরকত থেকে বঞ্চিত হবে তা কস্মিণকালেও পাবে না। এমনকি এ রোযার কাযা করে নিলেও তা ফিরে পাবে না। হাদীস শরীফে এসেছে ‘যে ব্যক্তি কোনো ওযর বা অসুস্থতা ব্যতিরেকে রমযানের একটি রোযা পরিত্যাগ করবে সে যদি ঐ রোযার পরিবর্তে আজীবন রোযা রাখে তবুও  ঐ এক রোযার ক্ষতি পূরণ হবে না।’ -জামে তিরমিযী, হাদীস ৭২৩\n" +
                "\n" +
                "অত্যন্ত দুঃখজনক বিষয় এই যে, আমাদের সমাজে অনেক সবল-সুঠাম দেহের অধিকারী ব্যক্তিও অকারণে, সামান্য ছুতায় অসুস্থ হওয়ার অমূলক আশংকায় রোযা পরিত্যাগ করে। এতে তারা আখেরাতের কত বড় ক্ষতি নিজের উপর টেনে নিচ্ছে তা একটু ভেবেও দেখে না।\n" +
                "\n" +
                "রোযার অর্থ : রোযা একটি ফারসী শব্দ। এর আরবী হল ‘ছওম’। ছওম এর আভিধানিক অর্থ বিরত থাকা। শরীয়তের পরিভাষায় ‘জ্ঞানবুদ্ধি সম্পন্ন মুসলমানের উপর সুবহে সাদিক তথা দিনের একেবারে শুরু ভাগ থেকে সূর্যাস্ত পর্যন্ত রোযার নিয়তে পানাহার, স্ত্রী সহবাস ও রোযাভঙ্গকারী অন্যান্য কার্যাদি থেকে বিরত থাকার নামই হল ‘সওম’ বা ‘রোযা’।’");
    }
}
