package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a5 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a5);


        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("রোযার হেকমত তথা অন্তনির্হিত তাৎপর্য সম্পর্কে আলোচনার পূর্বে একটি কথা ভালোভাবে জানা থাকা দরকার। তা এই যে, মহিয়ান গরিয়ান আল্লাহ তাআলা ও মানুষের মাঝে সম্পর্ক হল মহান স্রষ্টা ও ক্ষুদ্র সৃষ্টি এবং মহা মুনিব ও সাধারণ দাসের সম্পর্ক। এ সম্পর্কের সুস্পষ্ট দাবি হল, সর্বময় ক্ষমতার অধিকারী বিশ্ব প্রতিপালক স্রষ্টার যে কোনো নির্দেশ পালন করতে মানুষ সর্বদা প্রস্ত্তত থাকবে। ঐ নির্দেশের হেকমত (তাৎপর্য) তার বুঝে আসুক আর নাই আসুক। সুতরাং মহান আল্লাহ তাআলা যত প্রকার ইবাদতের নির্দেশ দিবেন সেগুলোর কোনো কারণ বা তাৎপর্যের পিছনে না পড়ে তৎক্ষণাৎ নতশিরে তা মেনে নেওয়াই হচ্ছে বান্দার দায়িত্ব। বলাবাহুল্য, শরীয়ত নির্দেশিত কোনো ইবাদতই তাৎপর্যহীন বা যুক্তিবিরোধী নয়। তবে সব কিছুর যুক্তি বা হেকমতই যে বান্দার জানা থাকবে বা বান্দার জ্ঞান-বুদ্ধি তাকে স্পর্শ করতে পারবে এমনটি ভাবা ঠিক নয়। কারণ আল্লাহ তাআলা বান্দাকে অতি সামান্য জ্ঞানই দান করেছেন। ইরশাদ হয়েছে- ‘তোমাদেরকে অতি সামান্য জ্ঞানই দান করা হয়েছে।’-সূরা আলইমরান ৮৫\n" +
                "\n" +
                "আল্লাহ রাববুল আলামীনের নির্দেশনসমূহে কত হেকমত, কত কারণ এবং কত উদ্দেশ্যই থাকতে পারে, বান্দার কত কল্যাণই তাতে নিহিত থাকতে পারে। অসীম জ্ঞানের অধিকারী সে স্বত্তার নির্দেশনসমূহ তাৎপর্য সসীম জ্ঞানসম্পন্ন মানুষ কতই বা বুঝতে পারবে! তবুও ইসলামী পন্ডিতগণ বিভিন্ন ইবাদতের বিভিন্ন ধরনের হেকমত বর্ণনা করেছেন। রোযার ব্যাপারেও বিভিন্ন হেকমতের কথা তাঁরা বলেছেন। যদিও শরীয়তের নির্দেশ মান্য করা এ সকল হেকমত বুঝে আসার সাথে সম্পর্কিত নয় তথাপি সম্মানিত পাঠকমন্ডলীর কৌতুহল নিবারণের উদ্দেশ্যে নিম্নে রোযার দু’একটি হেকমত সম্পর্কেও আলোকপাত করা হল।\n" +
                "\n" +
                "‘আল্লাহ তাআলা মানুষের স্বভাবে যে  ফেরেশতা সুলভ বৈশিষ্ট্য চরিত্র গচ্ছিত রেখেছেন, তার উন্নতি ও উৎকর্ষসাধন এবং নফস ও প্রবৃত্তির দমন ও নিবৃত্তির অন্যতম মাধ্যম হল রোযা। কানা’আত, আত্মশুদ্ধি, সবর ও শোকর, তাকওয়ার মতো  বৈশিষ্ট্যগুলোর উন্নতি ও বিকাশে রোযার গুরুত্বপূর্ণ ভূমিকা রয়েছে। উপরন্তু রোযার মাধ্যমে মানুষ উদার ও প্রবৃত্তিরথ  জৈবিক তাড়না হতে সম্পূর্ণ মুক্ত হয়ে ঊর্ধ্ব জগৎ তথা আপন স্রষ্টার সঙ্গে সম্পর্ক ও যোগসূত্র স্থাপনে সক্ষম হয়।\n" +
                "\n" +
                "তাছাড়া নিরেট চিকিৎসা বিজ্ঞানের দৃষ্টিতেও প্রত্যেক ব্যক্তির জন্য বছরের কিছু দিন অবশ্যই পানাহার বর্জন করা উচিত। এটি স্বাস্থ্যের জন্য বিশেষ উপকারী। তাই হিন্দু-খ্রষ্টান সকল সকল ধর্মেই রোযার মতো উপবাস করার প্রচলন রয়েছে। (যদিও ইসলামের রোযার সাথে সেসব উপবাসের পদ্ধতিগত বহু পার্থক্য রয়েছে)। (আরকানে আরবাআ : ২৬৪)");
    }
}
