package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a6 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a6);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("প্রত্যেক নেক আমলের বিভিন্ন ফযীলত ও ছওয়াব রয়েছে যা দ্বারা মহান রাববুল আলামীন আমলকারীকে পুরস্কৃত করবেন, কিন্তু রোযার বিষয়টি একেবারেই স্বতন্ত্র। কারণ রোযার বহুবিধ প্রতিদান ছাড়াও এ বিষয়ে একটি অতুলনীয় ঘোষণা রয়েছে। রাসূলে কারীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন -\n" +
                "\n" +
                "‘মানুষের প্রত্যেকটি আমলকে বৃদ্ধি করা হয়। একটি নেকী (সওয়াব) ১০ গুণ থেকে (ক্ষেত্র বিশেষে) ৭০০ গুণ পর্যন্ত বৃদ্ধি করা হয়। আল্লাহ তাআলা ইরশাদ করেন : কিন্তু রোযার ব্যাপারটি ভিন্ন। কারণ রোযা আমার জন্য। সুতরাং তার প্রতিদান আমি নিজেই প্রদান করব।’- সহীহ বুখারী, হাদীস ১৮৯৪; সহীহ মুসলিম, হাদীস ১১৫১/১৬৪\n" +
                "\n" +
                "এ হাদীসে দু’টি বিষয় প্রণিধানযোগ্য :\n" +
                "\n" +
                "১. রোযা ছাড়া অন্যান্য সব আমলের ছওয়াব বৃদ্ধির ব্যাপারে একটি সুনির্দিষ্ট নীতিমালা রয়েছে। তা হল ১০ গুণ থেকে ৭০০ গুণ পর্যন্ত। এটি সাধারণ নিয়ম। আল্লাহ তাআলা চাইলে বিশেষ ক্ষেত্রে এর চেয়ে বেশিও প্রদান করতে পারেন। তবে সাধারণত সব আমলের ছওয়াব এ নীতির মাধ্যমেই  নির্ণিত হয়। কিন্তু রোযার বিষয়টি স্বতন্ত্র। কারণ এর ছওয়াবের নির্ধারিত কোনো সীমারেখা নেই; বরং আল্লাহ তাআলা নিজে এর ছওয়াব প্রদানের ঘোষণা প্রদান করেছেন। এর পরিমাণ যে কত হবে তা একমাত্র তিনিই জানেন।\n" +
                "\n" +
                "রোযার এত বড় ফযীলতের একটি বাহ্যিক কারণ এও হতে পারে যে, রোযা ধৈর্য্যের ফলস্বরূপ। আর ধৈর্যধারণকারীদের জন্য আল্লাহ তাআলার সুসংবাদ হল-‘ধৈর্য্য ধারণকারীগণই অগণিত সওয়াবের অধিকারী হবে।’ -সূরা যুমার ১০\n" +
                "\n" +
                "২. সকল ইবাদত আল্লাহর জন্য। রোযার বহুবিধ বিশেষত্বের কারণে শুধু তাকেই নিজের জন্য খাস করে নিয়েছেন এবং বলেছেন- ‘রোযা তো আমারই জন্য, তাই রোযার প্রতিদান তিনি নিজেই দান করবেন এবং বে-হিসাব দান করবেন বলে তিনি রোযাদারকে সুসংবাদ দান করেছেন। -লাতায়িফ ১৬৮-১৭০\n" +
                "\n" +
                "হাদীস শরীফে রোযাদারের জন্য বিভিন্ন ধরনের পুরস্কার ও প্রতিদানের কথা বিবৃত হয়েছে। সেগুলোর কয়েকটি নিম্নে তুলে ধরছি : \n" +
                "\n" +
                "১.রোযা কিয়ামতের দিবস সুপারিশ করবে\n" +
                "\n" +
                "হাদীস শরীফে এসেছে- ‘রোযা ও কুরআন মজীদ কিয়ামতের দিন বান্দার জন্য সুপারিশ করবে। রোযা  বলবে, হে আল্লাহ!আমি তাকে দিনের বেলায় পানাহার ও যৌন সম্ভোগ থেকে পূর্ণ বিরত রেখেছি। কাজেই তাকে ক্ষমা করে দিন এবং পুরস্কৃত করুন এবং  তার ব্যাপারে আমার সুপারিশ কবুল করুন। আর কুরআন বলবে, আমি তাকে রাতে নিদ্রা থেকে বিরত রেখেছি। কাজেই তার ব্যাপারে আমার সুপারিশ কুবল করুন। অতঃপর তাদের সুপারিশ গ্রহণ করা হবে।’ -মুসনাদে আহমদ, হাদীস ৬৫৮৯; তবারানী-মাজমাউয যাওয়ায়েদ ৩/৫১৯\n" +
                "\n" +
                "২. রোযা জাহান্নামের আগুনের ঢাল ও দুর্গ\n" +
                "\n" +
                "হাদীস শরীফে এসেছে- ‘রোযা জাহান্নামের আগুন থেকে পরিত্রাণের জন্য একটি ঢাল এবং দুর্গ।’-মুসনাদে আহমদ, হাদীস ৮৯৭২\n" +
                "\n" +
                "৩. রোযাদার জান্নাতের রাইয়ান নামক শাহী তোরণ দিয়ে প্রবেশ করবে।\n" +
                "\n" +
                "এক হাদীসে বর্ণিত হয়েছে-‘জান্নাতে রাইয়ান নামক একটি শাহী তোরণ আছে যা দিয়ে একমাত্র রোযাদারগণই প্রবেশ করবে। অন্য কেউ সে তোরণ দিয়ে প্রবেশ করতে পারবে না।’ (‘আর যে ব্যক্তি সে রাইয়ান গেট দিয়ে প্রবেশ করবে সে আর কখনো পিপাসিত হবে না।’ সহীহ বুখারী ১/২৫৪;  সহীহ মুসলিম, হাদীস ১১৫২\n" +
                "\n" +
                "৪. রোযাদারের জীবনের সকল গুনাহ মাফ হয়ে যাবে।\n" +
                "\n" +
                "হাদীস শরীফে এসেছে- ‘যে ব্যক্তি পূর্ণ বিশ্বাস সহকারে ছওয়বের উদ্দেশ্যে রমযানের রোযা রাখে, আল্লাহ পাক তার জীবনের সকল গুনাহ ক্ষমা করে দিবেন।’ -সহীহ বুখারী, হাদীস ১৯০১\n" +
                "\n" +
                "৫. রোযাদারের দুআ কবুল হয়\n" +
                "\n" +
                "হাদীস শরীফে ইরশাদ হয়েছে-‘তিন ব্যক্তির দুআ ফেরত দেওয়া হয় না : রোযাদার ব্যক্তির ইফতারের সময়ের দুআ, ন্যায়পরায়ণ শাসকের দুআ ও মযলুমের দুআ। এ তিন ব্যক্তির দুআ আল্লাহ তাআলা মেঘমালার উপরে উঠিয়ে নেন। এবং এর জন্য আসমানের দরজাসমূহ খুলে দেওয়া হয়। তখন আল্লাহ তাআলা ইরশাদ করেন, আমার ইযযত ও মহাসম্মানের কসম!  বিলম্বে হলেও আমি অবশ্যই তোমাকে সাহায্য করব।’ -সহীহ ইবনে হিববান, হাদীস ৩৪২৮\n" +
                "\n" +
                "৬. রোযাদারের জন্য দুটি আনন্দ\n" +
                "\n" +
                "হাদীস শরীফে ইরশাদ হয়েছে-‘রোযাদার ব্যক্তির আনন্দ উপভোগের দুটি বিশেষ মুহূর্ত রয়েছে। একটি ইফতারের সময়, অপরটি স্বীয় প্রভূর সাথে সাক্ষাতের সময়।’ -সহীহ বুখারী, হাদীস ১৯০৪; সহীহ মুসলিম, হাদীস ১১৫১/১৬৪\n" +
                "\n" +
                "৭. রোযাদারের মুখের গন্ধ মিশকের চেয়েও সুঘ্রাণযুক্ত\n" +
                "\n" +
                "রোযার কারণে মুখে যে দুর্গন্ধ হয় আল্লাহ তাআলা তারও মূল্যায়ন করেছেন কল্পনাতীতভাবে। অনাহারের কারণে সৃষ্ট দুর্গন্ধ তাঁর কাছে মিশকের চেয়েও অধিক সুঘ্রাণ বলে জানিয়েছেন আর ধন্য করেছেন তাঁর প্রেমে মত্ত রোযাদারদের।\n" +
                "\n" +
                "নবী করীম সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন- ‘নিশ্চয় রোযাদারে মুখের (পানাহার বর্জনজনিত) গন্ধ আল্লাহর কাছে মিশকের সুগন্ধি অপেক্ষা উত্তম।’ -সহীহ বুখারী হাদীস, ১৯০৪\n" +
                "\n" +
                "এখানে উল্লেখ্য যে, বর্ণিত হাদীসে দুর্গন্ধ দ্বারা ঐ গন্ধকেই বুঝানো হয়েছে যা পানাহার বর্জনের কারণে পেটের ভিতর থেকে উত্থিত হয়।  দাত ও মুখ অপরিষ্কার রাখার কারণে যে দুর্গন্ধের সৃষ্টি হয় তা এখানে উদ্দেশ্য নয়। তাই রোযাদার ব্যক্তি অবশ্যই তার দাত ও মুখ পরিষ্কার রাখার ব্যাপারে সচেতন থাকবে।");
    }
}
