package com.example.romadanapp;
import android.os.Bundle;
import androidx.appcompat.app.AppCompatActivity;
import android.widget.TextView;

public class a7 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_a7);

        TextView t1=(TextView)findViewById(R.id.a1t);

        t1.setText("রোযার আদবসমূহ : \n" +
                "\n" +
                "১. দৃষ্টিকে সর্বপ্রকার গুনাহ থেকে হেফাযত করা। যেমন বেগানা মেয়েদের প্রতি দৃষ্টিপাত করা থেকে, টিভি-সিনেমা দেখা থেকে বিরত থাকা।\n" +
                "\n" +
                "২. যবানের হেফাযত। অর্থাৎ মিথ্যা, গীবত-পরনিন্দা, অশ্লীল কথাবার্তা ও ঝগড়া-বিবাদ থেকে দূরে থাকা। হাদীস শরীফে ইরশাদ হয়েছে - ‘যে ব্যক্তি রোযা অবস্থায় মিথ্যাচারিতা ও মন্দ কাজ করা পরিত্যাগ করেনি তার পানাহার পরিত্যাগের কোনোই গুরুত্ব আল্লাহর কাছে নেই। আল্লাহ তাআলা তার পানাহার ত্যাগ করার কোনোই পরোয়া করেন না। -সহীহ বুখারী হাদীস ১৯০৩\n" +
                "\n" +
                "অন্য এক হাদীসে মহানবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ইরশাদ করেন-\n" +
                "\n" +
                "‘রোযা অবস্থায় তোমাদের কেউ যেন কোনো অশ্লীল কিংবা মন্দ কথা না বলে। যেন কোনো প্রকার শোরগোল, হট্টগোলে লিপ্ত না হয়। যদি অন্য কেউ তাকে গালিগালাজ করে কিংবা মারধোর করে  তবে সে যেন (তদ্রূপ আচরণ বা গালির প্রতিউত্তর গালি না দিয়ে) শুধু এতটুকু জানিয়ে দেয় যে, আমি রোযাদার। -সহীহ বুখারী হাদীস ১৯০৪\n" +
                "\n" +
                "এতে প্রতীয়মান হয় যে, রোযা অবস্থায় মারধর ঝগড়াঝাটি তো দূরের কথা, শোরগোল করাও রোযার আদব পরিপন্থী। অতএব যবানকে এসব থেকে বিরত রেখে সর্বদা যিকির-আযকার ও কুরআন তেলাওয়াতের মাধ্যমে তরতাজা রাখবে। অন্তত চুপ থাকলেও রোযার বরকত বিনষ্ট হওয়া থেকে রেহাই পাওয়া যাবে।\n" +
                "\n" +
                "৩) কানকে সর্বপ্রকার গুনাহের কাজ থেকে হেফাযত করা। যেমন গানবাদ্য, গীবত, পরনিন্দা ও অশ্লীল কথাবার্তা শোনা থেকে দূরে থাকা।\n" +
                "\n" +
                "৪) এ ছাড়া অন্যান্য অঙ্গ-প্রত্যঙ্গ যেমন হাত ও পা ইত্যাদিকে গুনাহ ও খারাপ কাজ থেকে বিরত রাখা।\n" +
                "\n" +
                "৫) সাহরী ও ইফতারে হারাম আহার পরিহার করা। ইমাম গাজ্জালী রাহ. বলেন, যে ব্যক্তি সারাদিন রোযা রেখে হারাম মাল দ্বারা ইফতার করল, সে যেন একটি অট্টালিকা নির্মাণ করল এবং একটি শহর ধুলিস্যাত করে দিল।\n" +
                "\n" +
                "৬) যথাসম্ভব পানাহারে সংযমী হওয়া। কারণ ইফতার ও সাহরীতে প্রয়োজন অপেক্ষা কিছু কম খাওয়ার দ্বারাও রোযা শক্তিশালী হয় এবং পূর্ণাঙ্গতা লাভ করে। কারণ, অধিক পানাহারে অনেক সময় মানুষের কুপ্রবৃত্তিগুলো শক্তিশালী হয় এবং তাকে নানাবিধ পাপকার্যে লিপ্ত হতে উদ্বুদ্ধ করে। ইফতার ও সাহরীতে কম খাওয়ার দ্বারা কুপ্রবৃত্তিগুলো প্রশমিত হয়।\n" +
                "\n" +
                "৭) রোযা অবস্থায় আল্লাহ তাআলার আযমত ও বড়ত্বের কথা এবং তাঁর হুকুম আহকাম বেশি বেশি স্মরণ রাখা। রোযাদারের অন্তরে এ চিন্তা জাগরুক থাকা উচিত যে, আল্লাহ তাআলা হাযির নাযির আছেন। আমি তাঁর হুকুমে এবং তাঁরই সন্তুষ্টি অর্জনের জন্য পানাহার ত্যাগ করেছি। তাঁকে সন্তুষ্ট করার জন্য আমাকে ক্ষুধার্ত ও পিপাসার্ত থাকতে হবে।\n" +
                "\n" +
                "এভাবে এক মাস রোযা রাখা সম্ভব হলে ইনশাআল্লাহ আল্লাহ তাআলা আমাদেরকে তাকওয়া ও সংযমের মহামূল্য সম্পদ দান করবেন, যার মাধ্যমে ইহকালীন ও পরকালীন প্রভূত কল্যাণের দ্বার উন্মুক্ত হবে।\n" +
                "\n" +
                "আল্লাহ তাআলা আমাদেরকে তাওফীক দান করুন। আমীন।");
    }
}
